Repository: lk-dll/usbpicprog
Catalog: trunk/upp_wx_cdc/po/*.po
Languages: ar, bs, cs, de, he, hu, ms, ro, ru

source: Connected
ar: تم الإتصال
bs: Povezan
cs: - připojen
de: Verbunden
hu: Csatlakoztatva
ms: Tersambung
ro: conectat.
ru: Соединено

source: and
bs: i
cs: a
de: und
hu: és
ms: dan
ro: şi
ru: и

source: failed at 0x%X. Read: 0x%02X, Expected: 0x%02X
ar: فشلت عند 0x%X. القيمة المقروءة: 0x%02X ، القيمة المتوقعة: 0x%02X
bs: neuspjeh na 0x%X. Pročitano: 0x%02X, Očekivano: 0x%02X
cs: - chyba na adrese 0x%X. přečteno: 0x%02X, očekáváno: 0x%02X
de: Erfolglos bei 0x%X. Gelesen: 0x%02X, Erwartet: 0x%02X
hu: Itt hiba van 0x%X. Visszaolvasva: 0x%02X, ez helyett: 0x%02X
ms: gagal pada 0x%X. Read: 0x%02X, Expected: 0x%02X
ro: eşuat la 0x%X. Citit: 0x%02X, aşteptat: 0x%02X.
ru: ошибка в 0x%X. Прочитано: 0x%02X, Ожидалось: 0x%02X

source: %s [%d pins]
bs: %s [%d pinova]
cs: %s [%d pinů]
hu: %s [%d láb]
ro: %s [%d pini].

source: %s datasheet
cs: %s katalogový list
de: %s Datenblatt
he: %s דף נתונים
hu: %s adatlap
ro: Fişa tehnică %s
ru: %s спецификация

source: &About
ar: &حول البرنامج ...
bs: &O Programu
cs: &O programu
de: &Über
he: &אודות
hu: &Névjegy
ms: &Mengenai Kami
ro: Despre
ru: &Информация

source: &Actions
ar: ت&نفيذ
bs: &Akcije
cs: &Příkazy
de: &Aktionen
he: &פעולות
hu: &Műveletek
ms: &Tindakkan
ro: &Acţiuni
ru: &Действия

source: &Autodetect...
ar: &كشف تلقائي
bs: &Automatsko prepoznavanje...
cs: &Autodetekce
de: &Autoerkennen ...
he: &זיהוי אוטומטי
hu: &Automatikus felismerés...
ms: &Pengesanan Auto...
ro: &Autodetectează...
ru: &Автоопределение...

source: &Blankcheck...
ar: فحص ال&خلو
bs: &provjera na prazno...
cs: &Kontrola vymazání
de: L&eertest ...
he: &האם הרכיב ריק ?
hu: Tö&rlés ellenőrzés...
ms: &Pastikan Memori Kosong...
ro: Verifică &blank...
ru: Про&верка на "чистоту"...

source: &Copy
ar: &نسخ
bs: &Kopiraj
cs: &Kopírovat
de: &Kopieren
he: &העתק
hu: &Másolás
ms: &Salin
ro: &Copiază
ru: &Копировать

source: &Edit
ar: ت&حرير
bs: &Uredi
cs: &Upravit
de: &Bearbeiten
he: &עריכה
hu: &Szerkesztés
ms: &Sunting
ro: &Editare
ru: &Редактировать

source: &Erase...
ar: &مسح
bs: &Briši...
cs: &Vymazat
de: &Löschen ...
he: &מחיקה
hu: &Törlés...
ms: &Memadamkan...
ro: Şterge...
ru: &Стереть...

source: &File
ar: &ملف
bs: &Datoteka
cs: &Soubor
de: &Datei
he: &קובץ
hu: &Fájl
ms: &Fail
ro: &Fişier
ru: &Файл

source: &Help
ar: &تعليمات
bs: &Pomoć
cs: &Nápověda
de: &Hilfe
he: &עזרה
hu: &Súgó
ms: &Bantuan
ro: Ajutor
ru: &Помощь

source: &IO Test
de: &Ein/Ausgabe Test
he: &בדיקת כניסות ויציאות
hu: &I/O vizsgálat
ms: &Ujian IO
ro: Test &I/O
ru: &Тест IO

source: &New
ar: &جديد
bs: &Novi
cs: &Nový
de: &Neu
he: &חדש
hu: Ú&j
ms: &Baru
ro: &Nou
ru: &Новый

source: &Open
ar: &فتح
bs: &Otvori
cs: &Otevřít
de: &Öffnen
he: &פתח
hu: &Megnyitás
ms: &Buka
ro: Deschide
ru: &Открыть

source: &Options
bs: &Opcije
cs: &Nastavení
de: &Optionen
he: &אפשרויות
hu: &Lehetőségek
ms: &Pilihan
ro: &Opţiuni
ru: &Опции

source: &Preferences
ar: &خصائص
bs: &Postavke
cs: &Nastavení
de: &Einstellungen
he: &העדפות
hu: &Beállítások
ms: &Aturan
ro: &Preferinţe
ru: &Параметры

source: &Program...
ar: &باشر البرمجة
cs: &Programovat...
de: &Programmieren ...
he: &צריבה
hu: &Programozás...
ms: &Memuaturun Program...
ro: &Programează...
ru: &Программа

source: &Read...
ar: &قراءة
bs: &Učitaj...
cs: &Číst
de: &Lesen ...
he: &קריאה
hu: &Beolvasás...
ms: &Baca...
ro: Citeşte...
ru: П&рочесть...

source: &Reload
ar: إعادة ت&حميل
bs: &Ponovo učitaj
cs: &Obnovit
de: &Erneut laden
he: &טעינה חוזרת
hu: Új&ratöltés
ms: &Muat Semula
ro: &Reîncarcă
ru: &Перезагрузить

source: &Save
ar: حف&ظ
bs: &Sačuvaj
cs: &Uložit
de: &Speichern
he: &שמירה
hu: Menté&s
ms: &Simpan
ro: &Salvează
ru: &Сохранить

source: &Select PIC...
ar: اخ&تار الـPIC
bs: &Odaberi PIC...
cs: &Vybrat PIC...
de: &Selektiere PIC ...
he: &בחירת רכיב
hu: PIC választás
ms: &Pilih PIC...
ro: &Selectează PIC...
ru: В&ыбрать PIC

source: &Upgrade firmware
cs: Akt&ualizace firmwaru
ro: &Upgradează firmware

source: &Verify...
ar: ت&فحص
bs: &Potvrdi...
cs: &Zkontrolovat
de: &Vergleichen ...
he: &אימות
hu: &Ellenőrzés...
ms: &Mengesahkan...
ro: &Verifică...
ru: Пр&оверить

source: . Upgrade firmware?
cs: . Aktualizovat firmware?
ro: . Upgradaţi firmware ?

source: All operations completed
ar: انتهت جميع العمليات
bs: Sve operacije završene
cs: Všechny operace dokončeny
de: Alle Operationen sind abgeschlossen
he: כל הפעולות הסתיימו
hu: Minden művelet kész.
ms: Semua operasi selesai
ro: Toate operaţiunile terminate.
ru: Все операции завершены

source: An open source USB pic programmer
ar: مبرمجة للمتحكمات الصغرية PIC ذي المصدر المفتوح و على المنفذ USB
bs: USB pic programator otvorenog koda
cs: Open source USB PIC programátor
de: Ein Open Source USB PIC Programmer
he: צורב USB בקוד פתוח
hu: A nyílt forráskódú USB PIC programozó.
ms: Sebuah USB pic programmer sumber terbuka
ro: Un programator USB open source.
ru: USB PIC программатор с открытым исходным кодом

source: Autodetect on Connect
cs: Autodetekce při připojení
de: Automatische Erkennung beim Verbinden
hu: Automatikusan érzékeli a csatlakoztatást
ro: Autodetectare la conectare

source: Blankcheck failed at 0x%X. Read: 0x%02X, Expected: 0x%02X
ar: فشل فحص الخلو عند: 0x%X. القيمة المقروءة: 0x%02X ، القيمة المتوقعة: 0x%02X
bs: Neuspjeh pri provjeri na prazno 0x%X. Pročitano: 0x%02X, Očekivano: 0x%02X
cs: Kontrola vymazání selhala na adrese 0x%X. přečteno: 0x%02X, očekáváno: 0x%02X
de: Leertestfehler bei 0x%X. Gelesen: 0x%02X, Erwartet: 0x%02X
he: הרכיב אינו ריק ב 0x%X. Read: 0x%02X, Expected: 0x%02X
hu: Itt hibás az üres teszt 0x%X. Visszaolvasva: 0x%02X, ez helyett: 0x%02X
ms: Kenalpasti memori kosong gagal pada 0x%X. Read: 0x%02X, Expected: 0x%02X
ro: Verificare blank eşuată la 0x%X. Citit: 0x%02X, aşteptat: 0x%02X.
ru: Проверка на "чистоту" завершилась неудачей в 0x%X. Прочитано: 0x%02X, Ожидалось: 0x%02X

source: Blankcheck the PIC device
ar: تفحص خلو الـPIC
bs: Provjera na prazno PIC uređaja
cs: Zkontroluje vymazání PIC součástky
de: Leertest des PIC Controllers
he: האם הפיק ריק ?
hu: Ellenőrzi hogy üres-e a PIC.
ms: Kenalpasti Memori PIC kosong
ro: Verificare blank a PIC-ului
ru: Проверить PIC устройство на "чистоту"

source: Bootloader or programmer not found
ar: لم يتم العثور على الـBootloader أو المبرمجة
bs: Nije pronađen Bootloader ili programator
cs: nenalezen bootloader ani programátor
de: Bootloader oder den Programmer nicht gefunden
he: לא נמצא BOOTLOADER או צורב
hu: Nem találtam boot-betöltőt vagy programozót.
ms: Bootloader atau programmer tidak dijumpai
ro: Bootloader-ul sau programatorul nu a fost găsit.
ru: Загрузчик или программатор не найден

source: Can't create the package bitmap!
bs: Ne mogu napraviti bitmapu pakovanja!
cs: Nelze vytvořit obrázek pouzdra!
de: Kann die Gehäuse-Bitmap nicht erzeugen
he: לא ניתן לייצר את תמונת האריזה של הרכיב
hu: Nem lehet létrehozni a bitmap csomagot!
ms: Dilarang mencipta pakej bitmap!
ro: Nu se poate crea imaginea capsulei !

source: Can't draw the PIC package!
bs: Ne mogu nacrtati PIC pakovanje!
cs: Nemohu zobrazit pouzdro PICu!
de: Kann das PIC Gehäuse nicht zeichnen
he: לא ניתן לצייר את אריזת הרכיב
hu: Nem lehet kirajzolni a PIC tokozását!
ms: Dilarang melakar pakej PIC!
ro: Nu se poate desena capsula PIC !
ru: Невозможно изобразить PIC пакет!

source: Cannot load '%s'.
bs: Ne mogu učitati '%s'.
cs: Nelze načíst '%s'.
de: Kann '%s' nicht laden.
he: לא ניתן לטעון '%s'.
hu: Nem lehet betölteni '%s'.
ms: Dilarang memuatkan '%s'.
ro: Nu se poate încărca '%s'.
ru: Невозможно загрузить '%s'.

source: Cannot load XML PIC data.
ar: لا يمكن تحميل معطيات الـPIC من ملف الـXML
bs: Ne mogu učitati XML podatke za PIC.
cs: Nelze načíst XML data PICu.
de: Kann die XML PIC Daten nicht laden.
he: לא ניתן לטעון XML PIC data.
hu: Nem lehet betölteni a PIC XML adatait.
ms: Dilarang memuatkan maklumat XML PIC.
ro: Nu se pot încărca datele PIC XML.
ru: Невозможно загрузить данные XML PIC.

source: Cannot select a different PIC when the bootloader is connected!
ar: لا يمكن تحديد بيك آخر بعد الاتصال بالـBootloader!
bs: Ne mogu odabrati drugi PIC dok je bootloader povezan!
cs: Hexadecimální zobrazení kódové paměti PICu:
de: Kann keinen anderen PIC auswählen solange der Bootloader verbunden ist!
he: לא ניתן לבחור רכיב שונה בזמן שה Bootloader מחובר
hu: Nem választhat másik PIC-et, ha a bootloader van csatlakoztatva!
ms: Dilarang memilih PIC lain semasa bootloader masih tersambung!
ro: Nu se poate selecta alt PIC în modul bootloader !
ru: Невозможно выбрать другой PIC, когда загрузчик подключен!

source: Change the currently selected PIC
ar: تغيير نمط الـPIC المختار
bs: Promjeni trenutno odabrani PIC
cs: Změň aktuálně vybraný PIC
de: Ändern des aktuell selektierten PIC
he: שינוי הPIC הנבחר
hu: Cseréli a kiválasztott PIC-et
ms: Tukar PIC
ro: Schimbă PIC-ul selectat
ru: Изменить выбранный PIC

source: Checking if the device is blank...
ar: تفحص فيما إذا كان العنصر فارغ ...
bs: Provjeri da li je uređaj prazan...
cs: Kontroluji vymazání součástky...
de: Prüfen ob der PIC leer ist ...
he: בודק אם הרכיב ריק
hu: Ellenőzés ha az eszköz üres...
ms: Memeriksa jika memori peranti adalah kosong
ro: Verifică blank...
ru: Проверка устройства на чистоту...

source: Code
ar: شيفرة التعليمات
bs: Programski kod
cs: Kód
he: קוד
hu: Kód
ms: Kod
ro: Cod
ru: Код

source: Code Memory
ar: ذاكرة شيفرة التعليمات
bs: Programska memorija
cs: Programová paměť
de: Programmspeicher
he: זיכרון קוד
hu: Kód memória
ms: Memori Kod
ro: Memorie cod
ru: Объем кода

source: Code memory size:
ar: حجم ذاكرة شيفرة التعليمات:
bs: Veličina memorije programskog koda:
cs: Velikost kódové paměti:
de: Größe des Programmspeichers:
he: גודל זיכרון קוד
hu: A kódmemória mérete:
ms: Saiz Memori Kod:
ro: Dimensiune memorie de cod:
ru: Объем кода:

source: Code memory size: %d bytes
ar: حجم ذاكرة شيفرة التعليمات: %d bytes
bs: Veličina programske memorije: %d bajtova
cs: Velikost paměti kódu: %d bytů
de: Größe des Programmspeichers: %d Byte
he: גודל זיכרון קוד: %d bytes
hu: A kódmemória mérete %d bájt.
ms: Saiz Memori Kod: %d bytes
ro: Dimensiune memorie de cod: %d octeţi
ru: Объем кода: %d байт

source: Configuration Word:
ar: كلمة الإعدادات:
bs: Konfiguracijska riječ:
cs: Konfigurační slovo:
de: Konfigurationswort:
he: מילת קונפיגורציה
hu: Konfigurációs szó:
ms: Konfigurasi Perkataan:
ro: Word de configurare:
ru: Конфигурационное Слово:

source: Configuration flags
ar: أعلام الإعدادات
bs: Konfiguracijske zastavice
cs: Konfigurační flagy
de: Konfigurationsflags
he: דגלי קונפיגורציה
hu: Konfigurációs jelzők
ms: Konfigurasi flags
ro: Flag-uri de configurare
ru: Конфигурационные флаги

source: Configuration flags for this PIC:
ar: أعلام الإعدادات لهذا الـPIC:
bs: Konfiguracijske zastavice za ovaj PIC:
cs: Konfigurační flagy pro tento PIC:
de: Konfigurationsflags für diesen PIC:
he: דגלי קופיגורציה עבור רכיב זה :
hu: Konfiguráció jelzők erre a PIC-re
ms: Konfigurasi flags untuk PIC ini:
ro: Flag-uri de configurare pentru acest microcontroller:
ru: Конфигурационные флаги для этого PIC:

source: Connect Options
cs: Nastavení připojení
de: Verbindungsoptionen
hu: Csatlakozási lehetőségek
ro: Opţiuni de conectare

source: Copies to the clipboard currently selected cells
ar: نسخ الخلايا المحددة
bs: Kopira u clipboard trenutno odabrane ćelije
cs: Kopíruje vybrané buňky do schránky
de: Kopieren der ausgewählten Zellen in die Zwischenablage
he: מעתיק לקליפבורד את התאים שנבחרו
hu: A vágólapra másolja a kiválasztott cellákat.
ms: Salin sel-sel yang dipilih ke clipboard
ro: Copiază celulele selectate pe clipboard
ru: Скопировать в буфер выделенные ячейки

source: Copy
ar: نسخ
bs: Kopiraj
cs: Kopírovat
de: Kopieren
he: העתק
hu: Másolás
ms: Salin
ro: Copiază
ru: Копировать

source: Could not access the 'xml_data' folder.
ar: لا يمكن الوصول إلى المجلد 'xml_data'
bs: Ne mogu pristupiti 'xml_data' direktoriju.
cs: Nemám přístup do adresáře 'xml_data'.
de: Keinen Zugriff auf den "xml_data" Ordner
he: לא היתה גישה לספריה 'XML DATA'
hu: Nem lehet elérni az 'xml_data' könyvtárat.
ms: Gagal mengakses folder 'xml'_data'
ro: Nu se poate accesa directorul 'xml_data'.
ru: Невозможно получить доступ к папке 'xml_data'.

source: Could not create the worker thread!
ar: تعذر إنشاء خيط العمل (worker thread) !
bs: Ne mogu stvoriti radnu nit!
cs: Nepodařilo se vytvořit pracovní thread!
de: Kann das Programmteil nicht starten!
he: לא ניתן לייצר את השרשור !
hu: Nem sikerült létrehozni a munkamenetet!
ms: Gagal mencipta 'worker thread'!
ro: Nu se poate crea thread-ul de lucru !
ru: Невозможно создать рабочий поток!

source: Could not initialize libusb. This may happen because of: 1) an incorrect installation of the UsbPicProg driver; check if this is the case running the Windows Device Manager with the programmer attached; 2) An incorrect installation of cfgmgr32.dll, winusb.dll or hid.dll; Please re-install UsbPicProg and ensure that Windows recognizes the UsbPicProg hardware when it's attached to the USB bus. If Windows asks for a driver please point it to the 'UsbPicProg\driver' directory which has been installed in your Programs folder. If you still have problems please drop a mail on the UsbPicProg mailing list including your 'DPINST.LOG' file (which is located in your 'Windows\System32' folder).
bs: Ne mogu pokrenuti libusb. Ovo se može desiti zbog: 1) nepravilne instalacije upravljačkog programa za UsbPicProg; provjerite da li se radi o ovom pokretanjem Windows Device Manager-a sa spojenim programatorom; 2) nepravilne instalacije cfgmgr32.dll, winusb.dll ili hid.dll; Molimo ponovo instalirajte UsbPicProg i osigurajte da Windows prepoznaje UsbPicProg uređaj kada je spojen na USB priključak. Ako Windows traži upravljački program odaberite 'UsbPicProg\driver' direktorij koji je instaliran u vašem Programs direktoriju. Ako još uvijek imate probleme molimo pošaljite mail na UsbPicProg mailing listu zajedno sa 'DPINST.LOG' datotekom (koja se nalazi u vašem 'Windows\System32' direktoriju).
cs: Nemohu inicializovat libusb. Důvodem může být: 1) nesprávná instalace ovladače UsbPicProg; ověřte to spuštěním Správce zařízení Windows s připojeným programátorem; 2) nesprávná instalace cfgmgr32.dll, winusb.dll nebo hid.dll; Prosím, přeinstalujte UsbPicProg a ujistěte se, že Windows rozpoznávají UsbPicProg hardware, když jej připojíte do USB. Pokud Windows požádají o ovladač, zadejte cestu do adresáře 'UsbPicProg\driver', který byl nainstalován do složky programů. Pokud problém přetrvá, pošlete mail do UsbPicProg mailing listu s přiloženým souborem DPINST.LOG (naleznete jej ve složce 'Windows\System32').
de: Konnte die Bibliothek libusb nicht inittialisieren. Es kann sein: 1) nicht korrekte Installation der USBPICPROG Treiber; Prüfe in diesem Fall den Windows Geräte Manager mit angeschlossenem Programmer; 2) Nicht korrekte Installation von cfgmgr32.dll, winusb.dll oder hid.dll; Bitte USBPICPROG erneut installieren. Windows muss das Anstecken von USBPICPROG erkennen. Wenn Windows nach einem Treiber fragt auf das Verzeichnis 'UsbPicProg\driver' verweisen welches im Programme Verzeichnis installiert wurde. Sollte es Probleme geben sende eine E-Mail an die USBPICPROG Mail Liste mit der 'DPINST.LOG' Datei (zu finden im 'Windows\System32' Ordner).
he: לא ניתן לאתחל את libusb. הסיבה לכך עלולה להיות: 1) התקנה לא טובה של הדרייבר של UsbPicProg אנא בדוק את Windows Device Manager כאשר הצורב מחובר.; 2) התקנה לא טובה של cfgmgr32.dll , winusb.dll או hid.dll; אנא התקן מחדש את UsbPicProg, ואמת שWindows מזהה את חומרת הצורב כאשר מחברים אותה לUSB. אם תתבקש לספק דרייבר אנא הפנה את Windows לספריה 'UsbPicProg\driver' שהותקנה תחת הספריה של UsbPicProg בספרית Programs שלך. אם עדיין קיימת בעיה אנא הודע על כך במייל, דרך רשימת התכתובת שבאתר, וצרף את הקובץ 'DPINST.LOG' (שממוקם בספריה 'Windows\System32').
hu: Nem sikerült beállítani a libusb-t. Ez akkor fordulhat elő ha: 1) Helytelen az UsbPicProg meghajtó telepítése. Ellenőrizze a Windows Eszközkezelővel a programozó csatlakoztatását. 2) Nem megfelelő a cfgmgr32.dll, winusb.dll vagy hid.dll telepítése. Kérjük telepítse újra UsbPicProg-ot és biztosítsa, hogy a Windows felismerje a UsbPicProg hardvert amikor az USB buszra csatlakoztja. Ha a Windows meghajtót kér, mutassa meg neki az "UsbPicProg\driver" könyvtárat, amely már telepítve van a program mappájában. Ha még mindig problémái vannak, kérjük küldje el e-mailban a UsbPicProg levelezőlistára a "DPINST.LOG" fájlt (ezt a a "Windows\System32" mappában találja meg).
ms: Gagal memulakan libusb. Ini mungkin kerana:1) Pemasangan driver UsbPicProg yang salah; Periksa jika adalah punca masalah, jalankan Windows Device Manager ketika programmer disambungkan pada USB; 2) Pemasangan cfgmgr32.dll yang salah, winusb.dll atau hid.dll; Sila pasang semula UsbPicProg dan pastikan bahawa Windows mengenali hardware UsbPicProg apabila ia disambungkan pada USB. Jika Windows meminta driver, halakannya ke direktori/folder 'UsbPicProg\driver' yang mana telah dipasangkan dalam folder Programs Files anda. Jika anda masih mengalami masalah, sila email Pencipta UsbPicProg fail log 'DPINST.LOG' (terdapat dalam folder 'Windows\System32').
ro: Nu se poate iniţializa libusb. Aceasta poate fi cauzată de: 1) o instalare incorectă a driver-ului UsbPicProg; verificaţi dacă aceasta este problema folosind Device Manager cu programatorul ataşat; 2) o instalare incorectă a cfgmgr32.dll, winusb.dll sau hid.dll; Vă rugăm să reinstalaţi UsbPicProg şi să vă asiguraţi că Windows recunoaşte programatorul atunci când îl conectaţi pe portul USB. Dacă Windows cere un driver, vă rugăm să indicaţi către subdirectorul 'UsbPicProg\driver' instalat în directorul Program Files. Dacă problemele persistă, vă rugăm să lăsaţi un mesaj pe mailing list-ul UsbPicProg, incluzând şi fişierul 'DPINST.LOG' (găsit în directorul 'Windows\System32').
ru: Невозможно инициализировать libusb. Это может возникнуть по следующим причинам: 1) некорректная установка драйвера UsbPicProg; проверьте, запущен ли Windows Device Manager, когда программатор подключен; 2) некорректная установка cfgmgr32.dll, winusb.dll или hid.dll; Пожалуйста, переустановите UsbPicProg и убедитесь, что Windows распознает подключенное к шине USB аппаратное обеспечение UsbPicProg. Если Windows запрашивает драйвер, пожалуйста, укажите директорию 'UsbPicProg\driver', которая появилась в Вашей папке с программами. Если проблемы остались, пожалуйста, отправьте электронное письмо, содержащее файл 'DPINST.LOG' (который находится в папке 'Windows\System32') на список рассылки UsbPicProg.

source: Could not initialize libusb: %s
bs: Ne mogu pokrenuti libusb: %s
cs: Nepodařilo se inicializovat libusb: %s
de: Kann die libusb nicht initialisieren: %s
he: לא ניתן לאתחל את libusb: %s
hu: Nem sikerült beállítani a libusb-t: %s
ms: Gagal memulakan libusb: %s
ro: Nu se poate iniţializa libusb: %s.
ru: Невозможно инициализировать libusb: %s

source: Could not load data for PIC '%s'.
bs: Ne mogu učitati podatke za PIC '%s'.
cs: Nelze načíst data pro PIC '%s'.
de: Konnte die Daten '%'s für den PIC nicht laden.
he: לא ניתן לטעון את המידע עבור PIC '%s'.
hu: Nem sikerült betölteni az adatokat a PIC '%s' eszközbe.
ms: Gagal memuaturun maklumat ke dalam PIC '%s'.
ro: Nu se pot încărca datele pentru PIC-ul '%s'.
ru: Невозможно загрузить данные для PIC '%s'.

source: Could not open Hex file for writing...
bs: Ne mogu otvoriti Hex datoteku za pisanje...
cs: Nepodařilo se otevřít soubor HEX pro zápis...
de: Konnte die Hex-Datei zum Schreiben nicht öffnen ...
he: לא ניתן לפתוח את קובץ הHex לכתיבה
hu: Nem lehet megnyitni a Hex állományt az íráshoz...
ms: Dilarang membuka fail Hex ketika memuaturun program...
ro: Nu se poate deschide fişierul Hex pentru scriere...
ru: Невозможно открыть Hex файл для записи...

source: Could not open Hex file...
bs: Ne mogu otvoriti Hex datoteku...
cs: Nelze otevřít HEX soubor...
de: Konnte die Hex-Datei nicht öffnen ...
he: לא ניתן לפתוח את קובץ ה Hex
hu: Nem lehet megnyitni a Hex állományt...
ms: Gagal membuka fail Hex...
ro: Nu se poate deschide fişierul Hex...
ru: Невозможно открыть Hex файл ...

source: Could not run the worker thread!
ar: لا يمكن تشغيل خيط العمل (worker thread) !
bs: Ne mogu pokrenuti radnu nit!
cs: Nepodařilo se spustit pracovní thread!
de: Kann das Programmteil nicht starten!
he: לא ניתן להריץ את השרשור !
hu: Nem lehet futtatni a munkamenetet!
ms: Gagal menjalankan 'worker thread'!
ro: Nu se poate lansa thread-ul de lucru !
ru: Невозможно запустить рабочий поток!

source: Couldn't reset the USB device interface: %s
bs: Ne mogu ponovo pokrenuti sučelje USB uređaja: %s
cs: Nemohu resetovat rozhraní USB zařízení: %s
de: Konnte das USB Gerät: %s nicht zurücksetzen.
he: לא ניתן לאתחל מחדש את תקשורת הUSB: %s
hu: Nem lehet alaphelyzetbe állítani az USB eszköz illesztőt: %s
ms: Gagal reset antaramuka peranti USB: '%s'
ro: Nu se poate reseta interfaţa dispozitivului USB: %s.
ru: Невозможно сбросить интерфейс устройства USB: %s

source: Current HW state:
bs: Trenutno stanje uređaju:
cs: Aktuální stav HW:
de: Aktuelle HW Status:
he: מצב החומרה הנוכחי:
hu: A jelenlegi HW állapot:
ms: Keadaan semasa HW:
ro: Starea hardware curentă:
ru: Текущее состояние HW:

source: Current HW voltage:
bs: Trenutni napon na uređaju:
cs: Aktuální napětí HW:
de: Aktuelle HW Spannung:
he: מתח החומרה הנוכחי
hu: A jelenlegi HW feszültség:
ms: Nilai voltan semasa HW:
ro: Tensiunea hardware curentă:
ru: Текущее напряжение HW:

source: Current value for the %d-th configuration word as derived from above configuration choices
ar: القيمة الحالية لكلمة التحكم رقم %d مشتقة من الخيارات المختارة أعلاه
bs: Trenutna vrijednost za %d-u konfiguracijsku riječ izvedena na osnovu prethodnog izbora konfiguracije
cs: Aktuální hodnota %d. konfiguračního slova odvozená ze zvolených konfiguračních možností
de: Der aktuelle Wert des %d ten Konfigurationswortes ist abgeleitet von der Konfigurationswahl
he: ערכה הנוכחי של מילת התצורה ה%d כפי שנקבע באפשרויות התצורה
hu: A jelenlegi érték a %d-ik konfiguráció szó a fenti konfiguráció választékból.
ms: Nilai semasa untuk konfigurasi 'word' ke %d adalah diterbitkan daripada pilihan konfigurasi di atas
ro: Valoarea curentă pentru al %d-lea word de configurare, aşa cum rezultă din opţiunile de mai sus:

source: Data
ar: المعطيات
bs: Podaci
de: Daten
he: נתונים
hu: Adat
ms: Maklumat
ro: Date
ru: Данные

source: Data in hex file outside code memory of PIC
bs: Podatak u hex datoteci izvan programske memorije PIC-a
cs: Data v HEX souboru jsou mimo rozsah kódové paměti PICu.
de: Daten in der Hex Datei außerhalb des Programmspeichers des PIC.
he: המידע בקובץ ה Hex הוא מחוץ לזכרון הCODE של הPIC
hu: A Hex állományból kapott adat a PIC kódmemóriáján kívül esik.
ms: Maklumat dalam fail Hex tidak terkandung dalam kod memori PIC
ro: Datele din fişierul Hex depăşesc memoria de cod a PIC-ului.
ru: Данные в hex файле вне памяти кода PIC

source: Data in hex file outside config memory of PIC
bs: Podatak u hex datoteci izvan konfiguracijske memorije PIC-a
cs: Data v HEX souboru jsou mimo rozsah konfigurační paměti PICu.
de: Daten in der Hex Datei außerhalb des Konfigurationsspeichers des PIC.
he: המידע בקובץ ה Hex הוא מחוץ לזכרון הCONFIG של הPIC
hu: A Hex állományból kapott adat a PIC config memóriáján kívül esik.
ms: Maklumat dalam fail Hex tidak terkandung dalam konfigurasi memori PIC
ro: Datele din fişierul Hex depăşesc memoria de configurare a PIC-ului.
ru: Данные в hex файле вне конфигурационной памяти PIC

source: Data in hex file outside data memory of PIC
bs: Podatak u hex datoteci izvan podatkovne memorije PIC-a
cs: Data v HEX souboru jsou mimo rozsah datové paměti PICu.
de: Daten in der Hex Datei außerhalb des Datenspeichers des PIC.
he: המידע בקובץ ה Hex הוא מחוץ לזכרון הDATA של הPIC
hu: A Hex állományból kapott adat a PIC adat (EEPROM) memóriáján kívül esik.
ms: Maklumat dalam fail Hex tidak terkandung dalam data memori PIC
ro: Datele din fişierul Hex depăşesc memoria de date a PIC-ului.
ru: Данные в hex файле вне памяти данных PIC
