Repository: lk-dll/usbpicprog
Catalog: trunk/upp_wx_cdc/po/*.po
Languages: ar, bs, cs, de, he, hu, ms, ro, ru

source: Data memory size:
ar: حجم ذاكرة المعطيات:
bs: Veličina memorije podataka:
cs: Velikost datové paměti:
de: Größe des Datenspeichers:
he: גודל זיכרון הDATA :
hu: Az adatmemória mérete:
ms: Saiz memori maklumat:
ro: Dimensiune memorie de date:
ru: Объем памяти данных:

source: Data memory size: %d bytes
ar: حجم ذاكرة المعطيات: %d bytes
bs: Veličina memorije podataka: %d bajtova
cs: Velikost datové paměti: %d bytů
de: Größe des Datenspeichers: %d Byte
he: גודל זיכרון הDATA: %d בתים
hu: Az adatmemória mérete: %d bájt
ms: Saiz memori maklumat: %d bytes
ro: Dimensiune memorie de date: %d octeţi
ru: Объем памяти данных: %d байт

source: Datasheet
cs: Katalogový list
de: Datenblatt
he: דף נתונים
hu: Adatlap
ro: Fişa tehnică
ru: Спецификация

source: Detect the type of the PIC device
ar: كشف نمط الـPIC
bs: Prepoznaj tip PIC uređaja
cs: Detekuje typ PIC součástky
de: Erkennen des PIC Typs
he: זיהוי סוג הPIC
hu: Az észlelt PIC eszköz tipusa.
ms: Mengesan jenis PIC
ro: Detectează tipul PIC-ului
ru: Определить тип PIC устройства

source: Detected PIC model %s with device ID 0x%X
ar: عثر على الـPIC %s ذو الـID 0x%X
bs: Otkriven je PIC model %s sa ID uređaja 0x%X
cs: Nalezen PIC model %s s device ID 0x%X
de: Erkannter PIC Typ %s mit Geräte ID 0x%X
he: זוהה דגם ה PIC %s 0בעל מספר זיהוי 0x%X
hu: Az észlelt PIC típusa %s eszköz-azonosítója: 0x%X
ms: Dikesan: model PIC %s dengan ID peranti 0x%X
ro: A fost detectat modelul %s cu identificatorul 0x%X.
ru: Найден контроллер PIC модели %s с устройством ID 0x%X

source: Device ID:
ar: رمز العنصر (ID):
bs: ID uređaja:
cs: ID součástky:
de: Geräte ID:
he: מספר זיהוי:
hu: Eszköz-azonosító:
ms: ID Peranti:
ro: Identificator:
ru: ID устройства:

source: Device ID: 0x%X
ar: رمز العنصر (ID): 0x%X
bs: ID uređaja: 0x%X
cs: ID součástky: 0x%X
de: Geräte ID: 0x%X
he: מספר זיהוי: 0x%X
hu: Eszköz-azonosító: 0x%X
ms: ID Peranti:: 0x%X
ro: Identificator: 0x%X
ru: ID устройства: 0x%X

source: Device is blank
ar: العنصر خالٍ
bs: Uređaj je prazan
cs: Součástka je vymazaná
de: Der PIC ist leer.
he: הרכיב ריק
hu: Az eszköz üres.
ms: Peranti kosong.
ro: PIC-ul este blank.
ru: Устройство пусто

source: Device is not blank.
ar: العنصر ليس خالٍ
bs: Uređaj nije prazan.
cs: Součástka není vymazaná
de: Der PIC ist nicht leer.
he: הרכיב אינו ריק
hu: Az eszköz nem üres.
ms: Peranti TIDAK kosong.
ro: PIC-ul nu este blank.
ru: Устройство не пусто.

source: Disconnected
ar: مفصول
bs: Odspojen
cs: Odpojeno
de: Getrennt
he: מנותק
hu: Leválasztva
ms: Sambungan terputus
ro: Deconectat.
ru: Отсоединено

source: E&xit
bs: &Izlaz
cs: Konec
he: יציאה
hu: &Kilép
ms: &Keluar
ro: Ieşire
ru: &Выход

source: Edit
ar: تحرير
bs: Uredi
cs: Upravit
de: Editieren
he: עריכה
hu: Szerkeszt
ms: Sunting
ro: Editare
ru: Редактировать

source: Erase OK
ar: تم المسح
bs: Brisanje OK
cs: Vymazání OK
de: Löschen OK
he: נמחק
hu: A törlés rendben.
ms: Berjaya memadam
ro: Ştergere efectuată cu succes.
ru: Очистить OK

source: Erase before programming
ar: مسح قبل البرمجة
bs: Obriši prije programiranja
cs: Vymazat před programováním
de: Löschen vor dem Programmieren
he: מחיקה בטרם הצריבה
hu: Töröl mielőtt programoz
ms: Kosongkan sebelum memuaturun program
ro: Ştergere înaintea programării
ru: Очистить перед программированием

source: Erase the PIC device
ar: مسح الـPIC
bs: Obriši PIC uređaj
cs: Vymaže PIC součástku
de: Löschen des PIC Controllers
he: מחיקה של הרכיב
hu: Törli a PIC eszközt
ms: Kosongkan PIC
ro: Şterge memoria PIC-ului
ru: Очистить PIC-устройство

source: Erasing all areas of the PIC...
ar: مسح كافة مجالات الـPIC...
bs: Obriši sve dijelove PIC-a...
cs: Mažu všechny oblasti PICu...
de: Lösche alle Speicher des PIC ...
he: מוחק את כל איזורי הקוד ברכיב...
hu: Törlöm a PIC minden területét...
ms: Memadamkan keseluruhan PIC...
ro: Se şterg toate zonele de memorie PIC...
ru: Очистка всех областей PIC...

source: Erasing before programming...
ar: مسح قبل البرمجة
bs: Brišem prije porgramiranja...
cs: Mažu před programováním...
de: Löschen vor dem Programmieren
he: מוחק לפני צריבה...
hu: A programozás előtt törlök...
ms: Memadam sebelum memprogram...
ro: Se şterge memoria înaintea programării...
ru: Очистка перед программированием...

source: Error claiming the USB device interface: %s
bs: Pogreška tokom traženja sučelja USB uređaja: %s
cs: Chyba při požadavku od USB zařízení : %s
de: Fehler bei USB Geräteanforderung: %s
he: שגיאה בקביעת בעלות על ממשק הUSB: %s
hu: Nem sikerült elkérni az USB eszköz illesztőt: %s
ms: Ralat pada antaramuka peranti USB: %s
ro: Eroare la accesarea interfeţei USB: %s.
ru: Ошибка запроса интерфейса USB устройства: %s

source: Error erasing the device
ar: حدث خطأ أثناء مسح العنصر
bs: Pogreška tokom brisanja uređaja
cs: Chyba při mazání součástky
de: Fehler beim Löschen
he: שגיאה במחיקת הרכיב
hu: Hiba történt az eszköz törlése közben.
ms: Ralat semasa mengosongkan peranti
ro: Eroare la ştergere.
ru: Ошибка при очистке устройства

source: Error getting USB endpoint descriptor: %s
bs: Pogreška u traženju USB endpoint deskriptora. %s
cs: Chyba při získávání deskriptoru koncového bodu USB: %s
de: Fehler beim Erhalten des USB Endpunktbezeichners: %s
he: שגיאה בהשגת תיאור סיום USB: %s
hu: Nem lehet lekérdezni az USB végpont leíróját: %s
ms: Ralat mendapatkan 'USB endpoint descriptor': %s
ro: Eroare la obţinerea descriptorului de endpoint: %s.
ru: Ошибка получения endpoint-описателя USB: %s

source: Error in checksum...
bs: Pogreška u cheksumi...
cs: Chyba v kontrolním součtu...
de: Fehler in der Checksumme ...
he: שגיאה בסיכום ביקורת (checksum)
hu: Hibás az ellenőrző összeg.
ms: Ralat dalam semakan...
ro: Eroare la verificarea sumei de control.
ru: Ошибка контрольной суммы...

source: Error programming code memory
ar: حدث خطأ أثناء الكتابة في ذاكرة التعليمات
bs: Pogreška u programiranju memorije koda
cs: Chyba zápisu kódové paměti
de: Fehler beim Programmieren des Programmspeichers
he: שגיאה בצריבת זיכרון הקוד
hu: Nem sikerült a kódmemória programozása.
ms: Ralat memprogramkan kod memori...
ro: Eroare la programarea memoriei de cod.
ru: Ошибка программирования памяти кода

source: Error programming config memory
ar: حدث خطأ أثناء برمجة ذاكرة الإعدادات
bs: Pogreška u programiranju konfiguracijske memorije
cs: Chyba zápisu konfigurační paměti
de: Fehler beim Programmieren des Konfigurationsspeichers
he: שגיאה בצריבת זיכרון התצורה
hu: Nem sikerült a config memória programozása.
ms: Ralat memprogramkan konfigurasi memori
ro: Eroare la programarea memoriei de configurare.
ru: Ошибка программирования конфигурационной памяти

source: Error programming data memory
ar: حدث خطأ عند برمجة ذاكرة المعطيات
bs: Pogreška u programiranju memorije podataka
cs: Chyba zápisu datové paměti
de: Fehler beim Programmieren des Datenspeichers
he: שגיאה בצריבת זיכרון המידע
hu: Nem sikerült az adatmemória (EEPROM) programozása.
ms: Ralat memprogramkan data memori
ro: Eroare la programarea memoriei de date.
ru: Ошибка программирования памяти данных

source: Error reading code memory
ar: حدث خطأ أثناء قراءة ذاكرة التعليمات
bs: Pogreška u čitanju memorije koda
cs: Chyba čtení kódové paměti
de: Fehler beim Lesen des Programmspeichers
he: שגיאה בקריאת זכרון הקוד
hu: Nem sikerült olvasni a kódmemóriát.
ms: Ralat membaca kod memori
ro: Eroare la citirea memoriei de cod.
ru: Ошибка программирования памяти кода

source: Error reading configuration memory
ar: حدث خطأ عند قراءة ذاكرة الإعدادات
bs: Pogreška u čitanju konfiguracijske memorije
cs: Chyba čtení konfigurační paměti
de: Fehler beim Lesen des Konfigurationsspeichers
he: שגיאה בקריאת זכרון התצורה
hu: Nem sikerült olvasni a config memóriát.
ms: Ralat membaca konfigurasi memori
ro: Eroare la citirea memoriei de configurare.
ru: Ошибка чтения конфигурационной памяти

source: Error reading data memory
ar: حدث خطأ أثناء قراءة ذاكرة المعطيات
bs: Pogreška u čitanju memorije podataka
cs: Chyba čtení datové paměti
de: Fehler beim Lesen des Datenspeichers
he: שגיאה בקריאת זכרון המידע
hu: Nem sikerült olvasni az adatmemóriát (EEPROM).
ms: Ralat membaca data memori
ro: Eroare la citirea memoriei de date.
ru: Ошибка чтения памяти данных

source: Error restoring Calibration Registers
bs: Pogreška u vraćanju vrijednosti kalibracijskih registara
cs: Chyba při opravě calibračního registru
de: Fehler beim Rückspeichern des Kalibrationsregisters
he: שגיאה בשחזור רגיסטרי הכיול
hu: Nem sikerült visszaállítani a Kalibrációs regisztereket.
ms: Ralat memulihkan 'Calibration Registers'
ro: Eroare la refacerea regiştrilor de calibrare.
ru: Ошибка восстановления Регистров Калибровки

source: Error setting configuration of the USB device: %s
bs: Pogreška u podešavanju postavki USB uređaja: %s
cs: Chyba při pokusu o konfiguraci USB zařízení: %s
de: Fehler beim Setzen der Konfiguration des USB Gerätes: %s
he: שגיאה בקביעת תצורתו של התקן ה USB: %s
hu: Nem lehet kiválasztani az USB eszköz kialakítását: %s
ms: Ralat aturan konfigurasi pada peranti USB: %s
ro: Eroare la setarea configuraţiei dispozitivului USB: %s.
ru: Ошибка установки конфигурации USB устройства: %s

source: Examples
bs: Primjeri
cs: Příklady
de: Beispiele
he: דוגמאות
hu: &Példák
ms: Contoh
ro: Exemple
ru: Примеры

source: Exits the program
ar: الخروج من البرنامج
bs: Izlazi iz programa
cs: Ukončuje program
de: Beendet das Programm
he: יציאה מן התוכנה
hu: A program befejezése.
ms: Keluar dari program
ro: Părăseşte programul
ru: Выход из программы

source: FLOAT
cs: PLOVOUCÍ
hu: LEBEG
ro: FLOTANT

source: Failure in hex file...
bs: Neuspjeh u hex datoteci...
cs: Chybný HEX soubor...
de: Fehler in der Hex Datei
he: כשל בקובץ Hex
hu: Hiba van a Hex állományban...
ms: Kegagalan pada fail Hex...
ro: Eroare în fişierul Hex.
ru: Сбой в hex файле...

source: Firmware probably too new
bs: Firmware vjerojatno previše nov
cs: Firmware je asi příliš nový
de: Die Firmware ist zu neu
he: כפי הנראה, הקושחה חדשה מדי
hu: Valószínűleg túlságosan új a firmware.
ms: Kemungkinan Firmware terlebih baru
ro: Firmware (probabil) prea recent.
ru: Прошивка, возможно, слишком новая

source: Fit package drawing
bs: Prilagodi prikaz pakovanja
cs: Připojit obrázek pouzdra
de: Gehäusezeichnung
he: התאם ציור האריזה
hu: Illeszkedő tokrajz
ms: Pakej lakaran sesuai
ro: Dimensiune optimă

source: Frequency range: Min=%.2fMhz Max=%.2fMhz
ar: مجال التردد: القيمة الدنيى=%.2fMhz القيمة العظمى=%.2fMhz
bs: Frekvencijsko područje: Min=%.2fMhz Max=%.2fMhz
cs: Kmitočtový rozsah: Min=%.2fMhz Max=%.2fMhz
de: Frequenzbereich: Min=%.2fMhz Max=%.2fMhz
he: תווך תדרים: Min=%.2fMhz Max=%.2fMhz
hu: Frekvenciatartomány: Legalább=%.2f MHz Legföljebb=%.2f MHz
ms: Julat frekuensi: Min=%.2fMhz Max=%.2fMhz
ro: Domeniu de frecvenţe: Min=%.2fMhz Max=%.2fMhz
ru: Диапазон частот: Min=%.2fМГц Max=%.2fМГц

source: GUI options
ar: خيارات الواجهة الرسومية
bs: Opcije korisničkog sučelja
cs: Nastavení uživatelského rozhraní
de: GUI Optionen
he: אפשרויות ממשק
hu: A grafikus felület lehetőségei
ms: Pilihan GUI
ro: Opţiuni interfaţă
ru: Настройки интерфейса

source: Global settings for Usbpicprog:
ar: الإعدادات العامة لـUsbpicprog:
bs: Globalne postavke za Usbpicprog:
cs: Globální nastavení pro Usbpicprog:
de: Globale Einstellungen für USBPICPROG:
he: הגדרות כלליות עבור Usbpicprog:
hu: Az Usbpicprog általános beállításai
ms: Aturan Utama Usbpicprog:
ro: Setări globale pentru UsbPicProg:
ru: Глобальные настройки Usbpicprog:

source: HEX files (*.hex)|*.hex|HEX files (*.HEX)|*.HEX
cs: HEX soubory (*.hex)|*.hex|HEX soubory (*.HEX)|*.HEX
ro: Fişiere HEX (*.hex)|*.hex|Fişiere HEX (*.HEX)|*.HEX

source: Hexadecimal view of the code area of the PIC:
ar: عرض مجال تعليمات الـPIC بالنظام السداسي-عشري:
bs: Hexadecimalni pogled na područje programskog koda PIC-a:
cs: Hexadecimální zobrazení kódové paměti PICu:
de: Hexadezimale Sicht auf den Programmbereich des PIC:
he: תצוגה הקסדצימלית עבור איזור הקוד של הPIC
hu: A PIC kódterületének hexadecimális nézete:
ms: Lihat 'code area' PIC dalam Hexadecimal:
ro: Zona de memorie de cod - vedere hexazecimală:
ru: Шестнадцатеричное представление области кода PIC:

source: Hexadecimal view of the data area of the PIC:
ar: عرض مجال معطيات الـPIC بالنظام السداسي-عشري:
bs: Hexadecimalni pogled na područje podataka PIC-a:
cs: Hexadecimální zobrazení datové paměti PICu:
de: Hexadezimale Sicht auf den Datenbereich des PIC:
he: תצוגה הקסדצימלית עבור איזור הנתונים של הPIC
hu: A PIC adatterületének hexadecimális nézete:
ms: Lihat 'data area' PIC dalam Hexadecimal:
ro: Zona de memorie de date - vedere hexazecimală:
ru: Шестнадцатеричное представление области данных PIC:

source: I'm sorry for being stupid
ar: عذراً على غبائي
bs: Žao mi je što sam glup
cs: Promiňte mi moji blbost :-)
de: Tut mir leid, dass ich dumm bin
he: סליחה על טפשות
hu: Sajnálom, hogy hülyén viselkedik.
ms: Saya pohon maaf kerana macam bodoh
ro: Îmi cer scuze că sunt prost.
ru: Извините за глупость

source: INPUT
bs: ULAZ
cs: VSTUP
de: Eingang
he: קלט
hu: BEMENET
ro: INTRARE

source: In this dialog you can test the UsbPicProg hardware by sending requests to set a specific voltage on a specific output pin. The real voltage of the VPP pin and the other pins' statuses are updated once per second and are reported in bold below.
bs: U ovom dijalogu možete testirati UsbPicProg hardver slanjem zahtjeva za postavljanjem određenog napona na određeni pin. Stvarni napon VPP pina i stanje ostalih pinova se osvježava jednom u sekundi, a prikazuju se podebljano ispod.
cs: V tomto okně můžete otestovat jednotlivá napětí na výstupech UsbPicProg programátoru. Skutečné napětí pinu VPP a stavy ostatních pinů jsou aktualizovány jednou za sekundu a jsou uvedeny tučně.
de: In diesem Dialog kann die USBPICPROG Hardware getestet werden. Es werden Kommandos gesendet, die die Ausgabe Pins setzen. Die tatsächliche Spannung des VPP Pin und der Status der anderen Pins wird einmal pro Sekunde erneuert und in fetter Schrift ausgegeben.
he: בחלון זה ניתן לבדוק את חומרת הצורב ע"י שליחת פקודות לקבלת מתחים שונים ברגלי היציאה. ערכם האמיתי של המתחים מתעדכן ונרשם למטה אחת לשניה.
hu: Ebben az ablakban lehet vizsgálni a UsbPicProg hardvert úgy, hogy a neki küldött kérések egy választott feszültséget adnak a kiszemelt kimeneti lábra. A VPP láb valódi feszültsége és az egyéb lábak állapotai másodpercenként egyszer frissülnek és lejjebb látszanak vastagon szedve.
ms: Dalam paparan ini, anda boleh menguji hardware UsbPicProg dengan menghantar permintaan untuk setkan voltan tertentu pada pin output tertentu. Voltan pada pin VPP dan pin-pin yang lain akan dikemaskini sekali setiap 1 saat dan di paparkan dengan tulisan Bold dibawah.
ro: În această fereastră puteţi verifica partea hardware UsbPicProg trimiţând cereri de setare a anumitor nivele de tensiune pe anumiţi pini. Tensiunea reală a pinului VPP şi stările celorlalţi pini sunt reîmprospătate o dată pe secundă şi sunt raportate mai jos, cu caractere aldine.
ru: В этом диалоге Вы можете протестировать аппаратное обеспечение UsbPicProg, посылая запросы для установки определенных напряжений на определенные выходные пины. Настоящий вольтаж пина VPP и состояния других пинов обновляется каждую секунду и отображены ниже жирным шрифтом.

source: Initializing...
ar: تهيئة...
bs: Pokreće se...
cs: Inicializuji...
de: Initialisiere ...
he: מאתחל...
hu: Beállítom...
ms: Memulakan...
ro: Iniţializare...
ru: Инициализация...

source: Input/output test
bs: Ulazno/izlazni test
cs: Test vstupů a výstupů
de: Ein-/Ausgabetest
he: בדיקת קלט/פלט
hu: Bemenet / kimenet vizsgálat
ms: Uji Input/Output
ro: Test intrare-ieşire...
ru: Тест ввода/вывода

source: Invalid '%s' file.
bs: Neispravna '%s' datoteka.
cs: Neplatný soubor '%s' .
de: Ungültige '%s' Datei.
he: קובץ '%s' פסול.
hu: Érvénytelen '%s' állomány.
ms: Fail '%s' adalah fail yang salah
ro: Fişier %s invalid.
ru: Неправильный файл '%s'.

source: Invalid PIC family for PIC '%s'.
bs: Neispravna PIC familija za PIC '%s'.
cs: Neplatná PIC rodina pro PIC '%s'.
de: Ungültige PIC Familie für den PIC '%s'.
he: PIC פסול. משפחת PIC '%s'.
hu: A PIC '%s' családja érvénytelen.
ms: PIC family untuk PIC '%s' adalah salah
ro: Familie PIC nevalidă pentru PIC '%s'.
ru: Неправильно семейство PIC для PIC '%s'.

source: Invalid direction
bs: Neispravan pravac
cs: Neplatný příkaz
de: Ungültige Richtung
he: כיוון פסול
hu: Érvénytelen irány.
ms: 'Direction' tidak sah
ro: Direcţie nevalidă.
ru: Неправильное направление

source: Invalid odd pin count: %d
bs: Neispravan neparan broj pinova: %d
cs: Chybný lichý počet pinů: %d
de: Ungültige ungerade Pin Anzahl: %d
he: ספירת רגליים אי זוגיות פסולה: %d
hu: Hibás, páratlan lábszám: %d
ms: 'Odd pin count' tidak sah: %d
ro: Număr impar de pini nevalid: %d.
ru: Неправильное нечетное количество пинов: %d

source: Invalid pin count: %d
bs: Neispravan broj pinova: %d
cs: Chybný počet pinů: %d
de: Ungültige Pin Anzahl: %d
he: ספירת רגליים פסולה: %d
hu: Hibás lábszám: %d
ms: 'Pin count' tidak sah: %d
ro: Număr de pini nevalid: %d.
ru: Неправильное число пинов: %d

source: Length: %d bits
ar: الطول: %d bits
bs: Duljina: %d bitova
cs: Délka: %d bitů
de: Länge: %d Bit
he: אורך: %d ביט
hu: Szélessége: %d bit
ms: Kepanjangan: %d bits
ro: Lungime: %d biţi
ru: Длина: %d бит

source: Loads an HEX file for editing or programming...
ar: تحميل ملف هيكسا من أجل التعديل أو البرمجة
bs: Učitava HEX datoteku za izmjene i programiranje...
cs: Načítá HEX soubor pro editaci nebo programování
de: Laden der Hex Datei zum Editieren oder Programmieren ...
he: טוען קובץ Hex לעריכה או צריבה
hu: Egy HEX állomány betöltése szerkesztéshez vagy programozáshoz...
ms: Memuatkan fail Hex untuk disunting atau diprogramkan...
ro: Încarcă un fişier HEX pentru editare sau programare...
ru: Загружает HEX файл для редактирования или программирования...

source: Localize Usbpicprog in your System Language
hu: Az Usbpicprog a rendszer nyelvén kommunikál.
ro: UsbPicProg în limba Dumneavoastră

source: Location in memory: 0x%X
ar: التوضع في الذاكرة: 0x%X
bs: Lokacija u memoriji: 0x%X
cs: Pozice v paměti: 0x%X
de: Speicherstelle: 0x%X
he: מיקום בזיכרון: 0x%X
hu: Helye a memóriában: 0x%X
ms: Lokasi dalam memori: 0x%X
ro: Locaţia în memorie: 0x%X
ru: Местоположение в памяти: 0x%X

source: Miscellaneous
ar: منوعات
bs: Razno
cs: Různé
de: Verschiedenes
he: שונות
hu: Különféle
ms: Pelbagai
ro: Diverse
ru: Разное

source: No PIC detected!
ar: لم يتم العثور على الـPIC !
bs: Nije otkriven PIC!
cs: Žádný PIC nebyl nalezen!
de: Kein PIC erkannt!
he: לא זוהה PIC!
hu: Nem találtam PIC-et!
ms: Tiada PIC dikesan!
ro: Nu a fost detectat PIC !
ru: PIC не обнаружен!

source: No PIC detected! Selecting the default PIC (%s)...
ar: لم يتم العثور على PIC ! سيتم اختيار الـPIC الافتراضي ( %s ) ...
bs: Nije otkriven PIC! Odabir zadanog PIC (%s)...
cs: Žádný PIC nebyl nalezen! Volím defaultní PIC (%s)...
de: Kein PIC erkannt! Auswahl des voreingestellten PIC (%s)...
he: לא זוהה PIC! בוחר את ברירת המחדל PIC %s ...
hu: Nem találtam PIC-et! Az alapértelmezett PIC (%s) eszközt választom...
ms: Tiada PIC dikesan! Memilih PIC yang default (%s)...
ro: Nu a fost detectat PIC ! S-a selectat PIC implicit (%s)...
ru: PIC не обнаружен! Выбирается PIC по умолчанию (%s)...

source: No data to verify
bs: Nema podataka za provjeru
cs: Žádná data pro kontrolu
de: Keine Daten zum Vergleichen
he: אין מידע לאימות
hu: Nincs ellenőrizhető adat.
ms: Tiada data untuk disahkan
ro: Nu sunt date de verificat.
ru: Нет данных для проверки

source: No file to refresh
ar: لا يوجد ملف للإنعاش
bs: Nema datoteka za osvježenje
cs: Není otevřen žádný soubor pro obnovení
de: Keine Datei zum Erneuern
he: אין קובץ לרענון
hu: Nincs állomány a frissítéshez.
ms: Tiada fail untuk dimuat semula
ro: Nu există fişier de reîmprospătat.
ru: Нет файла для обновления

source: Note: red pins are (some of those) used in ICSP.
ar: ملاحظة: بعض الأقطاب الحمر مستخدمة من قبل الـICSP.
bs: Napomena: crveni pinovi (neki od njih) se koriste za ICSP.
cs: Poznámka: červené piny jsou (některé z nich) použity při ICSP.
de: Anmerkung: Die roten PINs werden für die ICSP benutzt.
he: הערה: הפינים האדומים (בחלקם) הם בשימוש בICSP.
hu: Megjegyzés: A piros lábakat (néhányat) használja az ICSP.
ms: Nota: Pin merah digunakan untuk ICSP (untuk kes-kes tertentu).
ro: Notă: pinii figuraţi cu roşu sunt (în parte) folosiţi pentru ICSP.
ru: Примечание: красные пины (некоторые из них) используются в ICSP.

source: Only valid for PIC12F629, PIC12F508, 10F20X and similar devices...
bs: Vrijedi samo za PIC12F629, PIC12F508, 10F20X i slične uređaje...
cs: Platné pouze pro PIC12F629, PIC12F508, 10F20X a podobné...
de: Nur Gültig für PIC12F629, PIC12F508, 10F20X und ähnliche Geräte ...
he: תקף רק עבור PIC12F629, PIC12F508, 10F20X וכד'
hu: Csak a PIC12F629, PIC12F508, PIC10F20X és hasonló eszközök érvényesek...
ms: Hanya sah pada PIC12F629, PIC12F508, 10F20X dan peranti yang sewaktu dengannya...
ro: Valid doar pentru PIC12F629, PIC12F508, 10F20X şi alte microcontrollere asemănătoare...
ru: Действительно только для PIC12F629, PIC12F508, 10F20X и аналогичных устройств...

source: Open firmware file
cs: Otevři soubor s firmwarem
ro: Deschide fişier firmware

source: Open hexfile
ar: فتح ملف الهيكسا
bs: Otvori hex datoteku
cs: Otevřít HEX soubor
de: Öffne Hex Datei
he: פתח קובץ Hex
hu: Megnyit egy HEX állományt
ms: Buka fail Hex
ro: Deschide fişier HEX
ru: Открыть hex-файл

source: Opens the Usbpicprog's website...
ar: الذهاب إلى موقع Usbpicprog على الانترنت
bs: Otvara Usbpicprog internet stranicu...
cs: Otevírá webovou stránku Usbpicprog...
de: Öffne die USBPICPROG Webseite
he: פתיחת האתר של Usbpicprog ...
hu: Megnyitja az Usbpicprog honlapján...
ms: Buka laman sesawang Usbpicprog...
ro: Deschide pagina web UsbPicProg...
ru: Открывает веб-сайт Usbpicprog...

source: Operations aborted
ar: تم الخروج من جميع العمليات
bs: Operacije prekinute
cs: Operace zrušena
de: Ausführung abgebrochen
he: הפעולות בוטלו
hu: A művelet megszakadt.
ms: Operasi dibatalkan
ro: Operaţii anulate.
ru: Операции прерваны

source: Operations completed with errors/warnings
ar: انتهت العملية لكن بوجود أخطاء و/أو تنبيهات
bs: Operacija završile sa greškama/upozorenjima
cs: Operace skončily s chybami/varováním
de: Ausführung mit Fehlern/Warnungen abgeschlossen
he: הפעולות נסתיימו עם שגיאות/אזהרות
hu: A művelet hibákkal/figyelmeztetésekkel fejeződött be.
ms: Operasi selesai dengan ralat/amaran
ro: Operaţii executate cu erori/avertismente.
ru: Операции завершены с ошибками/предупреждениями

source: PGC pin
he: PGC פין
hu: PGC láb
ms: Pin PGC
ro: Pin PGC (tact)
ru: PGC пин

source: PGD pin
he: PGD פין
hu: PGD láb
ms: Pin PGD
ro: Pin PGD (date)
ru: PGD пин

source: PIC info
ar: معلومات عن الـPIC
de: PIC Informationen
he: מידע על PIC
hu: PIC információ
ms: info PIC
ro: Informaţii microcontroller
ru: Информация о PIC

source: Package
ar: التعليبة
bs: Pakovanje
cs: Pouzdro
de: Gehäuse
he: אריזה
hu: Tokozás
ms: Pakej
ro: Capsulă
ru: Корпус

source: Please confirm
ar: الرجاء، قم بالتأكيد
bs: Molim potvrdite
cs: Potvrď
de: Bitte bestätigen
he: אנא אשר
hu: Kérem erősítse meg.
ms: Sila pastikan
ro: Vă rugăm să confirmaţi
ru: Пожалуйста, подтвердите

source: Please specify a BandGap Value between 0 and 3
bs: Navedite BandGap vrijednost između 0 i 3
cs: Prosím zadejte hodnotu BandGap v rozmezí 0 a 3
de: Bitte einen BandGAB Wert zwischen 0 und 3 auswählen
he: אנא הזן ערך עבור BANDGAP בין 0 ל3
hu: Kérem adja meg a BandGap értékét 0 és 3 között.
ms: Sila tetapkan satu nilai BandGap dari 0 hingga 3
ro: Vă rugăm să specificaţi o valoare BandGap între 0 şi 3.
ru: Пожалуйста, укажите значение BandGap между 0 и 3

source: Please specify a bandgap value
bs: Navedite bangap vrijednost
cs: Prosím zadejte hodnotu bandgap
de: Bitte einen bandgab Wert auswählen
he: אנא הזן ערך עבור BANDGAP
hu: Kérem adja meg a bandgap értékét.
ms: Sila tetapkan satu nilai BandGap
ro: Vă rugăm să specificaţi o valoare BandGap.
ru: Пожалуйста, укажите значение bandgap
