Repository: lk-dll/usbpicprog
Catalog: trunk/upp_wx_cdc/po/*.po
Languages: ar, bs, cs, de, he, hu, ms, ro, ru

source: Please specify a new Osccal Value [0xC00 - 0xCFF]
bs: Navedite novu Osccal vrijednost [0xC00 - 0xCFF]
cs: Prosím zadejte novou hodnotu Osccal [0xC00 - 0xCFF]
de: Bitte einen neuen Osccal Wert [0xC00- 0xCFF] wählen
he: אנא הזן ערך חדש עבור Osccal [0xC00 - 0xCFF]
hu: Kérem adjon meg egy új Osccal értéket [0xC00 - 0xCFF].
ms: Sila tetapkan semula nilai Osccal [0xC00 - 0xCFF]
ro: Vă rugăm să specificaţi o nouă valoare Osccal [0xC00 - 0xCFF].
ru: Пожалуйста, укажите новое значение Osccal [0xCFF - 0xCFF]

source: Please specify a new Osccal Value [3400 - 37FF]
bs: Navedite novu Osccal vrijednost [3400 - 37FF]
cs: Prosím zadejte novou hodnotu Osccal [3400 - 37FF]
de: Bitte einen neuen Osccal Wert [3400 - 37FF] wählen
he: אנא הזן ערח חדש עבור Osccal [3400 - 37FF]
hu: Kérem adjon meg egy új Osccal értéket [0x3400 - 0x37FF].
ms: Sila tetapkan semula nilai Osccal [3400 - 37FF]
ro: Vă rugăm să specificaţi o nouă valoare Osccal [3400 - 37FF].
ru: Пожалуйста, укажите новое значение Osccal [3400 - 37FF]

source: Please specify an Oscal Value between
bs: Navedite Oscal vrijednost između
cs: Prosím zadejte hodnotu Oscal v rozmezí
de: Bitte einen Osccal Wert zwischen
he: אנא הזן ערך עבור Osccal בין
hu: Kérem adja meg az Osccal értékét e határok között.
ms: Sila tetapkan semula nilai Osccal antara
ro: Vă rugăm să specificaţi o valoare Osccal între
ru: Пожалуйста, укажите значение Oscal между

source: Please specify an Oscal Value between %X and %X
bs: Navedite Oscal vrijednost između %X i %X
cs: Prosím zadejte hodnotu Oscal v rozmezí %X a %X
de: Bitte einen Osccal Wert zwischen %X und %X wählen
he: אנא הזן ערך חדש עבור Osccal בין %X ל%X
hu: Kérem adja meg az Osccal értékét %X és %X között.
ms: Sila tetapkan semula nilai Osccal antara %X dan %X
ro: Vă rugăm să specificaţi o valoare Osccal între %X şi %X.
ru: Пожалуйста, укажите значение Oscal между %X и %X

source: Please wait until the operations are completed:
ar: رجاءَ، الانتظار حتى تنتهي جميع العمليات:
bs: Molimo pričekajte dok se operacije završe:
cs: Počkejte na dokončení prováděných operací:
de: Bitte Warten bis alles beendet ist:
he: אנא המתן עד לסיום הפעולות:
hu: Kérem várjon, amíg a műveletek befejeződnek:
ms: Sila tunggu sehingga operasi selesai:
ro: Vă rugăm să aşteptaţi finalizarea operaţiilor:
ru: Пожалуйста, подождите, пока все операции не завершатся:

source: Preferences
ar: خصائص
bs: Postavke
cs: Nastavení
de: Einstellungen
he: העדפות
hu: Beállítások
ms: Aturan
ro: Preferinţe
ru: Настройки

source: Program options
ar: خيارات البرمجة
bs: Opcije programiranja
cs: Programová nastavení
de: Programmieroptionen
he: אפשרויות צריבה
hu: A programozás lehetőségei
ms: Pilihan Program
ro: Opţiuni de programare
ru: Опции программы

source: Program the PIC device
ar: برمجة الـPIC
bs: Programiraj PIC uređaj
cs: Naprogramuje PIC součástku
de: Programmieren des PIC Controllers
he: צריבת הPIC
hu: Programozza a PIC eszközt
ms: Muaturun program PIC
ro: Programează microcontrollerul
ru: Программировать PIC устройство

source: Programming configuration area of the PIC...
ar: برمجة مجال إعدادات الـPIC...
bs: Programiram konfiguracijsko područje PIC-a...
cs: Zapisuji konfigurační oblast PICu...
de: Programmieren des Konfigurationsspeichers des PIC ...
he: צורב את איזור התצורה בPIC...
hu: Programozom a PIC konfigurációs területét...
ms: Muaturun PIC 'configuration area'
ro: Programare a zonei de memorie de configurare...
ru: Программирование конфигурационной области PIC...

source: Programming the code area of the PIC...
ar: برمجة مجال التعليمات في الـPIC
bs: Programiram područje programskog koda PIC-a...
cs: Zapisuji kódovou oblast PICu...
de: Programmieren des Programmbereiches des PIC ...
he: צורב את איזור הקוד בPIC...
hu: Programozom a PIC kódterületét...
ms: Muaturun PIC 'code area'
ro: Programare a zonei de memorie de cod...
ru: Программирование области кода PIC...

source: Programming the data area of the PIC...
ar: برمجة مجال معطيات الـPIC
bs: Programiram područje podataka PIC-a...
cs: Zapisuji datovou oblast PICu...
de: Programmieren des Datenbereiches des PIC ...
he: צורב את איזור הנתונים בPIC...
hu: Programozom a PIC adatterületét...
ms: Muaturun PIC 'data area'
ro: Programare a zonei de memorie de date...
ru: Программирование области данных PIC...

source: Programming voltage (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
ar: جهد البرمجة (Vpp): الحهد الأصغري=%.2fV الجهد الأسمي=%.2fV الجهد الأعظمي=%.2fV
bs: Napon programiranja (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
cs: Programovací napětí (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
de: Programmierspannung (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
he: מתח הצריבה: Min=%.2fV Nom=%.2fV Max=%.2fV
hu: Programozó feszültség (Vpp): Legalább=%.2f V Névlegesen=%.2f V Legföljebb=%.2f V
ro: Tensiune de programare (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
ru: Напряжение программирования (Vpp): Min=%.2fВ Nom=%.2fВ Max=%.2fВ

source: Progress dialog
ar: نافذة التقدم
bs: Dijalog napredka
cs: Okno průběhu
de: Fortschrittsdialog
he: חלון התקדמות
hu: Haladást mutató ablak.
ms: paparan kemajuan proses
ro: Fereastră de progres
ru: Диалог прогресса

source: Read the PIC device
ar: قراءة الـPIC
bs: Pročitaj PIC uređaj
cs: Přečte PIC součástku
de: Lesen des PIC Controllers
he: קריאת הPIC
hu: Olvassa a PIC eszközt
ms: Baca peranti PIC
ro: Citire microcontroller
ru: Прочесть PIC устройство

source: Reading the code area of the PIC...
ar: قراءة مجال تعليمات الـPIC
bs: Čitanje područja programskog koda PIC-a...
cs: Čtu programovou oblast PICu...
de: Lese den Programmbereich des PIC ...
he: קורא את איזור הקוד בPIC
hu: A PIC kódterületének olvasása...
ms: Membaca 'code area' PIC
ro: Citire memorie de cod...
ru: Чтение области кода PIC-контроллера...

source: Reading the configuration area of the PIC...
ar: قراءة مجال إعدادات الـPIC
bs: Čitanje konfiguracijskog područja PIC-a...
cs: Čtu konfigurační oblast PICu...
de: Lesen des Konfigurationsbereiches des PIC ...
he: קורא את איזור התצורה בPIC
hu: A PIC konfigurációs területének olvasása...
ms: Membaca configuration area' PIC
ro: Citire memorie de configurare...
ru: Чтение области конфигурации PIC-контроллера...

source: Reading the data area of the PIC...
ar: قراءة مجال معطيات الـPIC
bs: Čitanje područja podataka PIC-a...
cs: Čtu datovou oblast PICu...
de: Lese den Datenbereich des PIC ...
he: קורא את איזור הנתונים בPIC
hu: A PIC adatterületének olvasása...
ms: Membaca 'data area' PIC
ro: Citire memorie de date...
ru: Чтение области данных PIC-контроллера...

source: Reboot option not available in this firmware, please remove the select jumper and disconnect / reconnect your usbpicprog.
cs: V tomto firmwaru není volba Reboot dostupná, prosím odstraňte propojku volby režimu a odpojte a znovu připojte programátor.
ro: Opţiunea de reboot nu este disponibilă în această versiune firmware, vă rugăm să îndepărtaţi jumper-ul de select şi să deconectaţi / reconectaţi programatorul.

source: Reloads the current HEX file from disk
ar: أعد تحميل ملف الهيكسا من القرص الصلب
bs: Ponovo učitava trenutnu HEX datoteku sa diska
cs: Obnovuje aktuální HEX soubor z disku
de: Die aktuelle Hex Datei erneut laden
he: טוען מחדש את קובץ הHex
hu: Újratölti a jelenlegi HEX állományt a lemezről.
ms: Muatsemula fail HEX semasa dari cakera keras
ro: Reîncarcă fişierul HEX curent de pe disc
ru: Перезагружает текущий HEX файл с диска

source: Resets the code, configuration and data areas of the currently open HEX file
ar: تصفير مجالات التعليمات و المعطيات و الإعدادات في ملف الهيكسا الحالي
bs: Ponovo postavlja područja koda, konfiguracije i podataka trenutačno otvorene HEX datoteke
cs: Resetuje programovou, konfigurační a datovou oblast nyní otevřeného HEX souboru
de: Rücksetzten des Programm-, Configurations- und Datenbereiches der aktuellen HEX Datei
he: מאתחל מחדש את איזורי הקוד, התצורה והנתונים של קובץ הHex הנוכחי
hu: Visszaállítja a kódot, konfigurációt és az adatok területeket a jelenleg megnyitott HEX állomány alapján.
ms: Reset 'code, configuration dan data areas' untuk fail Hex semasa
ro: Resetează memoria de cod, configurare şi date ale fişierului HEX curent
ru: Сбрасывает области кода, конфигурации и данных открытого HEX файла

source: Restore BandGap Register
bs: Vraća vrijednost BandGap registra
cs: Obnovit BandGap Registr
de: Rückspeichern des BandGap Register
he: השב את ערך הBANDGAP
hu: Visszaállítja a BandGap regisztert.
ms: Pulihkan 'BandGap Register'
ro: restaurează registrul BandGap
ru: Восстановить регистр BandGap

source: Restore Cal regs...
bs: Vrati Kal Reg...
cs: Obnov Cal reg...
de: Rückspeichen der CAL regs ...
he: השב את ערך רגיסטרי הכיול
hu: Visszaállítja a Kalibrációs regisztereket...
ms: Pulihkan 'Cal regs'...
ro: Restaurează regiştrii Cal...
ru: Восстановить регистры Cal...

source: Restore Osccal Register
bs: Povrati Osccal registar
cs: Obnovit Osccal Registr
de: Rückspeichern des Osccal Register
he: השב את רגיסטר הOsccal
hu: Visszaállítja az OscCal regisztert.
ms: Pulihkan 'Osccal Register'
ro: restaurează registrul Osccal
ru: Восстановить регистры Osccal...

source: Restore PIC's calibration registers
bs: Vrati kalibracijske registare PIC-a
cs: Obnovit PIC calibrační registr
de: Rückspeichern des PIC Kalibrationsregisters
he: השב את ערך רגיסטרי הכיול של הPIC
hu: A PIC kalibráló regiszterek visszaállítása.
ms: Pulihkan 'PIC's calibration registers'
ro: Restaurează regiştrii de calibrare ai microcontroller-ului
ru: Восстановить регистры калибровки PIC

source: Run Target
cs: Spustit cíl
de: Starte das Zielsystem
he: הרץ את רכיב המטרה
hu: futtatja a cél eszközt
ms: Jalankan Mikropengawal
ro: Lansează în execuţie
ru: Запустить цель

source: Save &As
ar: حفظ &باسم
bs: Spremi k&ao
cs: Uložit &jako...
de: Speichern &unter
he: שמור כ...
hu: Men&t mint
ms: Simpan &Sebagai
ro: Salvează ca...
ru: Сохранить &как

source: Save hexfile
ar: حفظ ملف الهيكسا
bs: Spremi hex datoteku
cs: Uložit HEX soubor
de: Speichern der Hex Datei
he: שמור קובץ Hex
hu: Hex állomány mentése
ms: Simpan fail Hex
ro: Salvează fişierul HEX
ru: Сохранить hex-файл

source: Saves current code,config,data as a HEX file
ar: حفظ شيفرة التعليمات و المعطيات و الإعدادات الحالية في ملف هيكسا
bs: Sprema trenutni kod, konfiguraciju, podatke kao HEX datoteku
cs: Ukládá program, data a konfigurační pojistky do HEX souboru
de: Speichern des aktuellen Code, der Konfiguration und Daten als Hex Datei
he: שומר את הקוד התצורה והנתונים הנוכחים כקובץ Hex
hu: Menti a jelenlegi kódot, konfigurációt és adatokat egyetlen Hex állományba.
ms: Simpan kod,konfigurasi,data sekarang sebagai fail Hex
ro: Salvează codul, configuraţia şi datele curente ca fişier HEX
ru: Сохраняет ткущий код, конфигурацию и данные в виде HEX файла

source: Saves the HEX file with the modified data
ar: حفظ التعديلات في ملف الهيكسا
bs: Sprema HEX datoteku s promjenjenim podacima
cs: Ukládá změny v HEX souboru na disk
de: Speichern der Hex Datei mit den modifizierten Daten
he: שומר את קובץ הHex עם הנתונים שהשתנו
hu: A módosított adatokat HEX állományba menti.
ms: Simpan fail Hex bersama data yang telah dimodifikasi
ro: Salvează fişierul HEX cu datele modificate
ru: Сохраняет HEX файл с измененными данными

source: Select &All
ar: تحديد ال&كل
bs: Od&aberi sve
cs: Vybr&at vše
de: &Alles auswählen
he: בחר הכל
hu: M&indent kijelöl
ms: Pilih &Semua
ro: Selectează tot
ru: Выделить Вс&е

source: Select All
ar: تحديد الكل
bs: Odaberi sve
cs: Vybrat vše
de: Alles Auswählen
he: בחר הכל
hu: Mindent kijelöl
ms: Pilih Semua
ro: Selectează tot
ru: Выделить Все

source: Selects the entire grid currently shown
ar: تحديد كافة الخلايا الظاهرة على الشاشة
bs: Odabire cijelu trenutno prikazanu mrežu
cs: Vybere celou zobrazenou oblast
de: Auswählen der aktuellen Anzeige
he: בוחר את המטריצה הנראי
hu: Mutatja az egész rácsot
ms: Pilih keseluruhan grid yang terpapar
ro: Selectează întreaga parte afişată

source: Set 0V to MCLR to stop the target controller
cs: Nastav 0V na MCLR k zastavení procesoru v aplikaci
de: MCLR auf 0V setzen um das Zielsystem zu stoppen
he: קובע 0V לפין MCLR בכדי לעצור את רכיב המטרה
hu: Az MCLR lábra 0V-ot adva megállítja a cél mikrovezérlőt.
ms: Set 0V pada MCLR untuk mematikan mikropengawal
ro: Setează MCLR la 0V pentru a opri execuţia
ru: Установить 0В на MCLR для остановки целевого контроллера

source: Set 5V to MCLR to run the target controller
cs: Nastav 5V na MCLR ke spuštění procesoru v aplikaci
de: MCLR auf 5V setzen um das Zielsystem zu starten
he: קובע 0V לפין MCLR בכדי להריץ את רכיב המטרה
hu: Az MCLR lábra 5V-ot adva elindítja a cél mikrovezérlőt.
ms: Set 5V pada MCLR untuk menjalankan mikropengawal
ro: Setează MCLR la 5V pentru a porni execuţia
ru: Установить 5В на MCLR для запуска целевого контроллера

source: Shows informations about this program
ar: إظهار المعلومات حول هذا البرنامج
bs: Prikazuje informacije o ovom programu
cs: Zobrazí informace o tomto programu
de: Informationen über das Programm anzeigen
he: מציג מידע אודות תוכנה זו
hu: Információkat mutat a programról.
ms: Papar informasi mengenai program ini
ro: Arată informaţii despre acest program
ru: Показывает информацию об этой программе

source: Shows popups on connect etc...
ar: إظهار نافذة منبثقة عند الاتصال و غير ذلك
bs: Prikazuje informacije prilikom povezivanja itd...
cs: Zobraz informaci při připojení atd...
de: Anzeige über die Verbindung ...
he: מציג הודעות חיבור וכו'
hu: Felugró ablakokat mutat a kapcsolódáskor és máskor...
ms: Papar pop-up ketika disambungkan...
ro: Prezintă ferestre popup la conectare etc.
ru: Показывает всплывающие окна при подключении и т.д.

source: Shows the options for this program
ar: إظهار خيارات هذا البرنامج
bs: Prikazuje opcije za ovaj program
cs: Zobrazí nastavení programu
de: Anzeige der Programmoptionen
he: מציג מידע אודות תוכנה זו
hu: Mutatja a program beállításait
ms: Paparkan aturan untuk program ini
ro: Arată opţiunile programului
ru: Показывает опции для этой программы

source: Specify a bandgap value
bs: Navedite bandgap vrijednost
cs: Zadejte hodnotu bandgap
de: Einen bandgab Wert bestimmen
he: הגדר ערך BANDGAP
hu: Megadja a bandgap értékét
ms: Tentukan nilai 'bandgap'
ro: Specificaţi o valoare BandGap
ru: Указать значение bandgap

source: Specify a new Osccal Value
bs: Navedite novu Osccal vrijednost
cs: Zadejte novou hodnotu Osccal
de: Einen neuen OSCCAL Wert bestimmen
he: הגדר ערך Osccal חדש
hu: Megad egy új OscCal értéket
ms: Tentukan nilai baru Osccal
ro: Specificaţi o nouă valoare Osccal
ru: Указать новое значение Osccal

source: Stop Target
cs: Zastav aplikaci
de: Stoppe das Zielsystem
he: עצור את רכיב המטרה
hu: megállítja a cél eszközt
ms: Matikan Mikropengawal
ro: Opreşte execuţia
ru: Остановить Цель

source: Supply voltage (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
ar: جهد التغذية (Vdd): الحهد الأصغري=%.2fV الجهد الأسمي=%.2fV الجهد الأعظمي=%.2fV
bs: Napon napajanja (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
cs: Napájecí napětí (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
de: Versorgungsspannung (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
he: מתח אספקה (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
hu: Tápfeszültség (Vdd): Legalább=%.2f V Névlegesen=%.2f V Legföljebb=%.2f V
ms: Voltan bekalan kuasa (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
ro: Tensiune de alimentare (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
ru: Приложенное напряжение (Vdd): Min=%.2fВ Nom=%.2fВ Max=%.2fВ

source: The HEX file '%s' has not been saved... its content will be lost; continue?
ar: ملف الهيكسا %s لم يحفظ، و سوف يضيع محتواه... المتابعة؟
bs: HEX datoteka '%s' nije spremljena... njen sadržaj će biti izgubljen; nastaviti?
cs: HEX soubor '%s' není uložen. Provedené změny budou ztraceny. Pokračovat?
de: Die Hex Datei '%s' wurde nicht gespeichert ... ihr Inhalt geht verloren; Weiter?
he: קובץ הHex '%s' לא נשמר... התוכן שלו יאבד; להמשיך?
hu: Nem mentette a(z) '%s' HEX állományt, a tartalma el fog veszni. Folytatja?
ms: Fail HEX '%s' tidak disimpan...segala kandungannya akan hilang; teruskan?
ro: Fişierul HEX '%s' nu a fost salvat... conţinutul său se va pierde; continuaţi ?
ru: HEX файл '%s' не был сохранен. Его содержимое будет утеряно. Продолжить?

source: The hardware should ask for next block
ar: يجب أن يطلب العتاد المادي المجموعة التالية
bs: Hardver mora tražiti sljedeći blok
cs: Hardware by měl požádat o další blok
de: Die Hardware sollte den nächsten Block anfordern
he: החומרה אמורה לבקש את הבלוק הבא
hu: A hardver kéri a következő blokkot.
ms: Hardware sepatutnya meminta blok seterusnya
ro: Hardware-ul ar trebui să ceară următorul bloc.
ru: Аппаратному обеспечению следует запросить следующий блок

source: The hardware should say OK
ar: يجب أن يستجيب العتاد المادي إيجابياَ
bs: Hardvera treba reći OK
cs: Hardware by měl vrátit OK
de: Die Hardware sollte OK geben
he: החומרה אמורה להחזיר ערך 'OK'
hu: A hardvernek mondani kell hogy rendben.
ms: Hardware sepatutnya OK
ro: Hardware-ul ar trebui să returneze OK.
ru: Аппаратное обеспечение должно ответить "OK"

source: The programmer is not connected
ar: المبرمجة ليست على اتصال
bs: Programator nije povezan
cs: Programátor není připojen
de: Das Programmiergerät ist nicht angeschlossen
he: הצורב אינו מחובר
hu: Nincs csatlakoztatva a programozó.
ms: Programmer tidak tersambung
ro: Programatorul nu este conectat.
ru: Программатор не подключен

source: This is a 32bit application running under a 64bit Window version. UsbPicProg won't be able to connect to the hardware! Please uninstall this program and download the UsbPicProg installer for 64bit operating systems.
bs: Ovo je 32-bitna aplikacija pokrenuta na 64-bitnoj inačici Windows-a. UsbPicProg neće biti u mogućnosti da se spoji sa hardverom! Molimo Vas da deinstalirate ovaj program i preuzimete UsbPicProg instalacijsku datoteku za 64bitne operativne sustave.
cs: Toto je 32bit aplikace spuštěná pod 64bit verzí Windows. UsbPicProg nebude moci připojit programátor! Odinstalujte současnou verzi programu a stáhněte UsbPicProg instalátor pro 64bitové operační systém.
de: Diese 32Bit Applikation läuft unter einer 64Bit Version. USBPICPROG kann sich nicht mit der Hardware verbinden! Bitte dieses Programm deinstallieren und USBPICPROG für 64 Bit OS herunterladen und installieren.
he: זו אפליקציה של 32 ביט שרצה על חלון של 64 ביט. USBPICPROG לא יוכל להתחבר לחומרת הצורב! אנא הורד והתקן גרסא מתאימה ל64 ביט.
hu: Ez egy 32 bites alkalmazás amit 64 bites Windows verzión futtat. Az UsbPicProg nem lesz képes csatlakozni a hardverre! Kérjük, távolítsa el ezt a programot és töltse le a UsbPicProg telepítőt 64 bites operációs rendszerre.
ms: Ini adalah software 32-bit yang dijalankan di atas Windows versi 64-bit. UsbPicProg tidak dapat disambungkan dengan hardware! Sila buang software ini kemudian muat turun pemasang UsbPicProg untuk OS 64-bit.
ro: Aceasta este o aplicaţie 32-bit, rulând pe un sistem de operare 64-bit. UsbPicProg nu se va putea conecta la programator ! Vă rugăm să dezinstalaţi această versiune şi să instalaţi versiunea 64-bit.
ru: Это 32-битное приложение запущено под 64-битной версией Windows. UsbPicProg не будет в состоянии соединиться с аппаратным обеспечением! Пожалуйста, удалите эту программу и загрузите инсталлятор UsbPicProg для 64-битных операционных систем.

source: Trying to read memory outside allowed area: bc+i=%d; memory size=%d
bs: Pokušaj čitanja memorije izvan dozvoljenog područja: bc+i=%d; veličina memorije=%d
cs: Pokus o čtení paměti mimo povolenou oblast: bc+i=%d; velikost paměti=%d
de: Lesen eines Speichers außerhalb des erlaubten Bereiches: bc+i=%d; memory size=%d
he: מנסה לקרוא זכרון מחוץ לאיזור המותר: bc+i=%d; גודל הזכרון=%d
hu: Próbálok olvasni az engedélyezett memóriaterületen kívül: bc+i=%d, memória méret=%d
ms: Mencuba untuk membaca memori luar dari kawasan yang dibenarkan: bc+i=%d; saiz memori=%d
ro: Încercare de citire memorie în afara zonei permise: bc+i=%d; dimensiune memorie=%d.
ru: Попытка прочесть память вне разрешенной зоны: bc+i=%d; размер памяти=%d

source: Type:
ar: النمط:
bs: Tip:
cs: Typ:
de: Typ:
he: סוג:
hu: Tipus:
ms: Jenis:
ro: Tip:
ru: Тип:

source: Type: %d-bit microcontroller
ar: النمط: متحكم صغري من %d بتات
bs: Tip: %d-bitni mikrokontroler
cs: Typ: %d-bitový mikrokontrolér
de: Typ: %d-bit Mikrocontroller
he: מיקרוקונטרולר מסוג: %d-bit
hu: Tipus: %d-bites mikrovezérlő
ms: Jenis: Mikropengawal %d-bit
ro: Tip: microcontroller pe %d biţi
ru: Тип: %d-битный микроконтроллер

source: USB error during blankcheck
ar: حدث خطأ من الـUSB أثناء فحص الخلو
bs: USB greška prilikom provjere na prazno
cs: USB chyba během kontroly vymazání
de: USB Fehler während eines Leertestes
he: שגיאת USB בעת בדיקה לרכיב ריק
hu: USB hiba történt az üres teszt közben.
ms: Ralat USB ketika blankcheck
ro: Eroare USB survenită în timpul verificării blank.
ru: Ошибка USB во время проверки на "чистоту"

source: USB error during verify
ar: حدث خطأ من الـUSB أثناء التفحص
bs: USB greška prilikom provjere
cs: USB chyba během kontroly
de: USB Fehler beim Vergleichen
he: שגיאת USB בעת אימות
hu: USB hiba történt az ellenőrzés közben.
ms: Ralat USB ketika pengesahan
ro: Eroare USB survenită în timpul verificării.
ru: Ошибка USB во время проверки

source: USB error while writing code memory
ar: حدث خطأ من الـUSB أثناء الكتابة في ذاكرة التعليمات
bs: USB grešaka prilikom pisanja memorije programskog koda
cs: USB chyba během zápisu kódové paměti
de: USB Fehler beim Schreiben des Programmspeichers
he: שגיאת USB בעת כתיבת זכרון הקוד
hu: USB hiba történt a kód memória írása közben.
ms: Ralat USB ketika memuaturun kod memori
ro: Eroare USB survenită în timpul scrierii memoriei de cod.
ru: Ошибка USB во время записи памяти кода

source: Unable to open file
ar: لا يمكن فتح الملف
bs: Ne mogu otvoriti datoteku
cs: Soubor se nepodařilo otevřít
de: Datei öffnen ist nicht möglich
he: לא ניתן לפתוח את הקובץ
hu: Nem lehet állományt megnyitni.
ms: Gagal membuka fail
ro: Nu se poate deschide fişierul.
ru: Невозможно открыть файл

source: Unable to read firmware version
ar: تعثر قراءة رقم إصدار البرنامج الثابت (firmware version)
bs: Ne mogu pročitati firmware verziju
cs: Nepodařilo se přečíst verzi firmware
de: Das Lesen der Firmwareversion ist nicht möglich
he: לא ניתן לקרוא את גרסת הקושחה
hu: Nem lehet beolvasni a firmware változatát.
ms: Gagal membaca versi firmware
ro: Nu se poate citi versiunea firmware.
ru: Невозможно прочесть версию прошивки

source: Unable to read version
ar: لا يمكن قراءة رقم الإصدار
bs: Ne mogu pročitati verziju
cs: Nepodařilo se přečíst verzi
de: Version ist nicht lesbar
he: לא ניתן לקרוא את הגרסה
hu: Nem lehet beolvasni a változatot.
ms: Gagal membaca versi
ro: Nu se poate citi versiunea.
ru: Невозможно прочесть версию

source: Unable to run target
cs: Nelze spustit cíl
de: Das Zielsystem kann nicht gestartet werden.
he: לא ניתן להריץ את רכיב המטרה
hu: Nem lehet futtatni a cél eszközt.
ms: Gagal menjalankan mikropengawal
ro: Nu se poate lansa în execuţie.
ru: Невозможно запустить указанное

source: Unable to save file
ar: لا يمكن حفظ الملف
bs: Ne mogu spremiti datoteku
cs: Soubor se nepodařilo uložit
de: Das Speichern ist nicht möglich
he: לא ניתן לשמור את הקובץ
hu: Nem lehet állományba menteni.
ms: Gagal memnyimpan fail
ro: Nu se poate salva fişierul.
ru: Невозможно сохранить файл

source: Unable to stop target
cs: Nelze zastavit cíl
de: Das Zielsystem kann nicht gestoppt werden.
he: לא ניתן לעצור את רכיב המטרה
hu: Nem lehet leállítani a cél eszközt.
ms: Gagal memberhentikan mikropengawal
ro: Nu se poate opri execuţia.
ru: Невозможно остановить указанное

source: Unknown error during blankcheck
ar: حدث خطأ غير معروف أثناء فحص الخلو
bs: Nepoznata greška prilikom provjere na prazno
cs: Neznámá chyba během kontroly vymazání
de: Unbekannter Fehler während des Leertestes
he: שגיאה לא ידועה בזמן בדיקה - האם הרכיב ריק
hu: Ismeretlen hiba történt az üres teszt közben.
ms: Ralat yang tidak dikenali ketika blankcheck
ro: Eroare necunoscută survenită în timpul verificării blank.
ru: Неизвестная ошибка во время проверки на "чистоту"
