Repository: lk-dll/usbpicprog
Catalog: trunk/upp_wx_cdc/po/*.po
Languages: ar, bs, cs, de, he, hu, ms, ro, ru

source: Unknown error during verify
ar: حدث خطأ غير معروف أثناء التفحص
bs: Nepoznata greška prilikom provjere
cs: Neznámá chyba během kontroly
de: Unbekannter Fehler beim Vergleichen
he: שגיאה לא ידועה בזמן אימות
hu: Ismeretlen hiba történt az ellenőrzés közben.
ms: Ralat yang tidak dikenali ketika pengesahan
ro: Eroare necunoscută survenită în timpul verificării.
ru: Неизвестная ошибка во время проверки

source: Unsupported Windows version. UsbPicProg runs only on Windows XP or later.
bs: Nepodržana Windows inačica. UsbPicProg radi samo na Windows XP ili novijem.
cs: Nepodporovaná verze Windows. UsbPicProg je spustitelný pod Windows XP a novější.
de: Das Stoppen des Zielsystems ist nicht möglichNicht unterstützte Windows Version. USBPICPROG läuft nur unter Windows XP oder späteren Versionen.
he: גרסת ווינדוס לא נתמכת.UsbPicProg רץ על ווינדוס XP ומעלה
hu: Ismeretlen Windows változatot használ. Az UsbPicProg csak Windows XP vagy későbbi rendszeren fut.
ms: Tidak menyokong versi Windows ini. UsbPicProg hanya beroperasi dengan Windows XP atau yang lebih baru.
ro: Versiune Windows nesuportată. UsbPicProg rulează doar sub Windows XP sau mai recent.
ru: Неподдерживаемая версия Windows. UsbPicProg работает только на Windows XP или более поздних.

source: Upgrade firmware?
cs: Aktualizovat firmware?
ro: Upgradaţi firmware-ul ?

source: Upgrade the firmware in usbpicprog
cs: Aktualizovat firmware v programátoru
ro: Upgradaţi firmware-ul UsbPicProg

source: Usbpicprog is not running in bootloader mode
cs: Programátor není v bootloader módu
ro: UsbPicProg nu rulează în mod bootloader.

source: Usbpicprog rev:
cs: Usbpicprog verze:
he: Usbpicprog גרסה:
hu: Usbpicprog változat:
ro: Revizie UsbPicProg:

source: VDD pin
he: VDD פין
hu: VDD láb
ms: Pin VDD
ro: Pin VDD (alimentare)
ru: VDD пин

source: VPP pin
he: VPP פין
hu: VPP láb
ms: Pin VPP
ro: Pin VPP (programare)
ru: VPP пин

source: Variants:
bs: Varijante:
cs: Varianty:
de: Varianten:
he: משתנים:
hu: Változatok:
ro: Variantă:
ru: Варианты:

source: Verify after programming
ar: التفحص بعد البرمجة
bs: Provjeri nakon programiranja
cs: Zkontrolovat po naprogramování
de: Vergleich nach dem Programmieren
he: אימות לאחר צריבה
hu: Programozás után ellenőrzést végez
ms: Pengesahan selepas memprogram PIC
ro: Verifică după programare
ru: Проверить после программирования

source: Verify code
ar: تفحص شيفرة التعليمات
bs: Provjeri kod
cs: Kontrola kódu
de: Vergleiche den Programmcode
he: אימות קוד
hu: Kód ellenőrzés
ms: Sahkan kod
ro: Verifică codul
ru: Проверить код

source: Verify code memory
ar: تفحص ذاكرة التعليمات
bs: Provjeri memoriju koda
cs: Kontrola kódové paměti
de: Vergleiche den Programmspeicher
he: אימות זכרון קוד
hu: A kódmemória ellenőrzése
ms: Sahkan kod memori
ro: Verifică memoria de cod
ru: Проверить память кода

source: Verify config
ar: تفحص الإعدادات
bs: Provjeri konfiguraciju
cs: Kontrola konfigurace
de: Vergleiche die Konfiguration
he: אימות תצורה
hu: Config ellenőrzés
ms: Sahkan konfigurasi
ro: Verifică configuraţia
ru: Проверить конфигурацию

source: Verify config memory
ar: تفحص ذاكرة الإعدادات
bs: Provjeri memoriju konfiguracije
cs: Kontrola konfigurační paměti
de: Vergleiche den Konfigurationsspeicher
he: אימות זכרון תצורה
hu: A config memória ellenőrzése
ms: Sahkan konfigurasi memori
ro: Verifică memoria de configuraţie
ru: Проверить память конфигурации

source: Verify data
ar: تفحص المعطيات
bs: Provjeri podatke
cs: Kontrola dat
de: Vergleiche die Daten
he: אימות נתונים
hu: Adat ellenőrzés
ms: Sahkan data
ro: Verifică datele
ru: Проверить данные

source: Verify data memory
ar: تفحص ذاكرة المعطيات
bs: Provjeri memoriju podataka
cs: Kontrola datové paměti
de: Vergleiche den Datenspeicher
he: אימות זכרון נתונים
hu: Az adatmemória ellenőrzése
ms: Sahkan memori data
ro: Verifică memoria de date
ru: Проверить память данных

source: Verify error while writing code memory
ar: تفحص الأخطاء أثناء الكتابة في ذاكرة المعطيات
bs: Provjeri pogrešku prilikom pisanja memorije koda
cs: Chyba kontroly během zápisu kódové paměti
de: Fehler beim Schreiben des Programmspeichers
he: שגיאת אימות בזמן כתיבת זכרון הקוד
hu: Figyeli a hibákat amíg írja a kódmemóriát.
ms: Ralat pengesahan ketika memuaturun kod memori
ro: Eroare la verificare survenită în timpul scrierii memoriei de cod.
ru: Проверить ошибки при записи в память кода

source: Verify options
ar: تفحص الإعدادات
bs: Provjeri opcije
cs: Možnosti kontroly
de: Vergleiche die Optionen
he: אפשרויות אימות
hu: Ellenőrzési lehetőségek
ms: Aturan Pengesahan
ro: Opţiuni de verificare
ru: Проверить опции

source: Verify successful
ar: نجح التفحص
bs: Provjera uspješna
cs: Kontrola proběhla úspěšně
de: Vergleich erfolgreich
he: אימות הושלם בהצלחה
hu: Az ellenőrzés készen van.
ms: Pengesahan Berjaya!
ro: Verificare încheiată cu succes.
ru: Проверить успешность

source: Verify the PIC device
ar: تفحص الـPIC
bs: Provjeri PIC uređaj
cs: Zkontroluje naprogramování PIC součástky
de: Vergleichen mit dem PIC Controller
he: אימות רכיב הPIC
hu: A PIC eszköz ellenőrzése
ms: Sahkan PIC
ro: Verifică microcontrollerul
ru: Проверить PIC устройство

source: Verify unknown
bs: Provjera nepoznatog
cs: Výsledek kontroly není znám
de: Vergleich unbekannt
he: אימות לא ידוע
hu: Az ellenőrzés eredménye ismeretlen.
ms: Pengesahan unknown
ro: Verificare necunoscută.
ru: Проверить на неизвестность

source: Verifying all areas of the PIC...
ar: تفحص كافة مجالات الـPIC ...
bs: Provjeri sva područja PIC-a...
cs: Kontroluji všechny oblasti PICu...
de: Vergleiche alle Bereiche des PIC ...
he: אימות כל איזורי הPIC
hu: Ellenőrzöm a PIC minden területét...
ms: Sahkan keseluruhan PIC
ro: Verificare a tuturor zonelor microcontrollerului...
ru: Проверить все области PIC

source: Write Code memory OK
ar: تمت الكتابة في ذاكرة التعليمات
bs: Upis memorije koda OK
cs: Zápis kódové paměti OK
de: Schreiben des Programmspeichers ist OK
he: כתיבת זכרון הקוד הושלמה בהצלחה
hu: A kódmemória írása rendben van.
ms: Muaturun kod memori OK
ro: Scriere memorie de cod OK.
ru: Записать память кода OK

source: Write Config memory OK
ar: تمت الكتابة في ذاكرة الإعدادات
bs: Upis memorije konfiguracije OK
cs: Zápis konfigurační oblasti OK
de: Schreiben des Konfigurationsspeichers ist OK
he: כתיבת זכרון התצורה הושלמה בהצלחה
hu: A config memória írása rendben van.
ms: Muaturun konfigurasi memori OK
ro: Scriere memorie de configurare OK.
ru: Записать память конфигурации OK

source: Write Data memory OK
ar: تمت الكتابة في ذاكرة المعطيات
bs: Upis memorije podataka OK
cs: Zápis datové oblasti OK
de: Schreiben des Datenspeichers ist OK
he: כתיבת זכרון הנתונים הושלמה בהצלחה
hu: Az adatmemória írása rendben van.
ms: Muaturun data memori OK
ro: Scriere memorie de date OK.
ru: Записать память денных OK

source: Write code memory
ar: كتابة ذاكرة التعليمات
bs: Upiši u programsku memoriju
cs: Zápis kódové paměti
de: Schreibe den Programmspeicher
he: כתיבת זכרון הקוד
hu: A kódmemória írása
ms: Memuaturun kod memori
ro: Scriere memorie de cod.
ru: Записать память кода

source: Write code not implemented for current PIC
ar: البرنامج باصداره الحالي لا يدعم الكتابة في مجال التعليمات على هذا الـPIC
bs: Upis programskog koda nije dostupan za trenutni PIC
cs: Zápis kódu není pro aktuálně vybraný typ součástky implementován.
de: Schreiben des Programmspeichers ist für diesen PIC nicht implementiert
he: כתיבת קוד אינה מיושמת עבור הPIC הנוכחי
hu: A választott PIC-hez a kódterület írása nincs megvalósítva.
ms: Kod yang dimuaturun tidak dapat dijalankan dengan jenis PIC semasa
ro: Scriere cod neimplementată pentru microcontrollerul curent.
ru: Записать код, не осуществленный текущим PIC

source: Write config memory
ar: كتابة ذاكرة الإعدادات
bs: Upiši u konfiguracijsku memoriju
cs: Zápis konfigurační paměti
de: Schreibe den Konfigurationsspeicher
he: כתיבת זיכרון התצורה
hu: A config memória írása
ms: Memuaturun konfigurasi memori
ro: Scriere memorie de configurare
ru: Записать память конфигурации

source: Write config not implemented for current PIC
ar: البرنامج باصداره الحالي لا يدعم كتابة الإعدادات على هذا الـPIC
bs: Upis konfiguracije nije dostupan za trenutni PIC
cs: Zápis konfigurace není pro aktuálně vybraný typ součástky implementován
de: Schreiben des Konfigurationsspeichers ist für diesen PIC nicht implementiert
he: כתיבת תצורה אינה מיושמת עבור הPIC הנוכחי
hu: A választott PIC-hez a config terület írása nincs megvalósítva.
ms: Konfigurasi yang dimuaturun tidak dapat dijalankan dengan jenis PIC semasa
ro: Scriere configurare neimplementată pentru microcontrollerul curent.
ru: Записать конфигурацию, не осуществленную текущим PIC

source: Write data memory
ar: كتابة ذاكرة المعطيات
bs: Upiši u memoriju podataka
cs: Zápis datové paměti
de: Schreibe den Datenspeicher
he: כתיבת זכרון הנתונים
hu: Az adatmemória írása
ms: Memuaturun data memori
ro: Scriere memorie de date
ru: Записать память денных

source: Write data not implemented for current PIC
ar: البرنامج باصداره الحالي لا يدعم كتابة المعطيات على هذا الـPIC
bs: Upis podataka nije dostupan za trenutni PIC
cs: Zápis dat není pro aktuálně vybraný typ součástky implementován
de: Schreiben des Datenspeichers ist für diesen PIC nicht implementiert
he: כתיבת נתונים אינה מיושמת עבור הPIC הנוכחי
hu: A választott PIC-hez az adatterület írása nincs megvalósítva.
ms: Data yang dimuaturun tidak dapat dijalankan dengan jenis PIC semasa
ro: Scriere date neimplementată pentru microcontrollerul curent.
ru: Записать данные, не осуществленные текущим PIC

source: You are using a stable release of the firmware with a development version of the software. Consider upgrading your firmware
bs: Koristite stabilnu verziju firmware-a zajedno sa razvojnom verzijom software-a. Razmislite o nadogradnji vašeg firmware-a
cs: Používáte stabilní verzi firmwaru s vývojovou verzi softwaru. Zvažte aktualizaci firmwaru
de: Sie benutzen eine stabile Version der Firmware mit einer Entwicklungsversion der Software. Erwägen Sie die Erneuerung Ihrer Firmware.
he: הנך משתמש בגרסה יציבה של הקושחה ובגרסת פיתוח של תוכנה. אנא שקול לשדרג את הקושחה
hu: A firmware egy stabil kiadását a szoftver fejlesztői változatával használja. Legyen szíves frissítse a firmware-t.
ms: Anda sedang menggunakan versi software yang masih dalam pembangunan dengan firmware yang stabil. Sila naiktaraf software anda...
ro: Folosiţi un firmware stabil cu o versiune software în dezvoltare. Upgradaţi firmware-ul.
ru: Вы используете стабильную версию прошивки с разрабатываемой версией ПО. Полагаем, следует обновить ПО

source: Your firmware is too old (latest version is %d); please consider upgrading it
bs: Vaš firmware je previše star (zadnja verzija je %d); razmislite o nadogradnji
cs: Váš firmware je příliš starý (poslední verze je %d); prosím zvažte aktualizaci
de: Ihre Firmware ist zu alt (die letzte Version ist %d); Bitte erneuern Sie diese.
he: הקושחה ישנה מדי. (גרסה אחרונה %d). אנא שקול לשדרג אותה
hu: A firmware túlságosan régi (a legutóbbi változat a %d). Kérem hogy frissítse föl.
ms: Firmware anda telah usang (versi terbaru adalah %d); sila naiktaraf.
ro: Firmware-ul este prea vechi (ultima versiune este %d); vă rugăm să upgradaţi.
ru: Ваша прошивка слишком устарела (последняя версия %d); пожалуйста, обновите ее

source: Your firmware is too old (latest version is %d.%d.%d); please consider upgrading it
bs: Vaš firmware je previše star (zadnja verzija je %d.%d.%d); razmislite o nadogradnji
cs: Váš firmware je příliš starý (poslední verze je %d.%d.%d); prosím zvažte aktualizaci
de: Ihre Firmware ist zu alt (die letzte Version ist %d.%d.%d); Bitte erneuern Sie diese.
he: הקושחה ישנה מדי. (גרסה אחרונה %d %d %d). אנא שקול לשדרג אותה
hu: A firmware túlságosan régi (a legutóbbi változat a %d.%d.%d). Kérem hogy frissítse föl.
ms: Firmware anda telah usang (versi terbaru adalah %d.%d.%d); sila naiktaraf.
ro: Firmware-ul este prea vechi (ultima versiune este %d.%d.%d); vă rugăm să upgradaţi.
ru: Ваша прошивка слишком устарела (последняя версия %d.%d.%d); пожалуйста, обновите ее

source: Zoom in
ar: تكبير
bs: Povećati
cs: Zvětšit
de: Vergrößern
he: הגדל
hu: Nagyítás be
ms: Zum besarkan
ro: Mărire
ru: Приблизить

source: Zoom out
ar: تصغير
bs: Smanjiti
cs: Zmenšit
de: Verkleinern
he: הקטן
hu: Nagyítás ki
ms: Zum kecilkan
ro: Micşorare
ru: Отдалить

source: autodetect
ar: كشف تلقائي
bs: automatsko prepoznavanje
cs: detekovat typ
de: Selbsterkennung
he: זיהוי אוטומטי
hu: automatikus felismerés
ms: automatik kesan
ro: autodetectează
ru: автоопределение

source: blankcheck
ar: فحص الخلو
bs: provjera na prazno
cs: zkontrolovat vymazání
de: Leertest
he: בדיקה, האם הרכיב ריק
hu: üres teszt
ro: verifică blank
ru: проверка на "чистоту"

source: blankcheck the device
ar: فحص خلو العنصر
bs: provjera na prazno uređaja
cs: zkontroluj vymazání součástky
de: Prüfen ob der PIC leer ist
he: בדיקה, האם הרכיב ריק
hu: vizsgálja hogy törölt-e az eszköz
ms: blankcheck peranti
ro: verificare blank a microcontrollerului
ru: проверить устройство на "чистоту"

source: boot
ro: boot-are

source: bulk erase the device
ar: مسح شامل للعنصر
bs: grupno brisanje uređaja
cs: kompletně vymaž součástku
de: Löschen des gesamten PIC
he: מחיקת הרכיב
hu: teljesen törli az eszközt
ms: Padam peranti secara pukal
ro: ştergere bulk a microcontrollerului
ru: стереть все устройство

source: currently selected PIC type
ar: نمط الـPIC المختار
bs: trenutno odabran PIC tip
cs: aktuálně vybraný typ PICu
de: zur Zeit ausgewählter PIC Typ
he: סוג הPIC הנוכחי
hu: A jelenleg kijelölt PIC tipus
ms: Jenis PIC semasa
ro: tipul microcontrollerului
ru: выбранный тип PIC

source: debug
cs: ladit
he: ניפוי (DEBUG)
hu: nyomkövetés
ms: nyahpijat
ro: depanare
ru: отладка

source: debug the hardware
bs: debug hardvera
cs: ladění HW aplikace
de: die Hardware debuggen
he: ניפוי החומרה (DEBUG)
hu: Hibakeresés a hardverben.
ms: nyahpijat hardware
ro: depanare hardware
ru: отладка аппаратного обеспечения

source: displays help on the command line parameters
ar: إظهار المساعدة حول استخدام البرنامج مع موجه التعليمات (command prompt)
bs: prikazuje pomoć o parametrima naredbenog retka
cs: zobrazuje nápovědu k parametrům příkazového řádku
de: Anzeige der Kommandozeilenparameter
he: מציג את העזרה עבור פרמטרים של שורת פקודה
hu: Segítséget ad a parancsori paraméterekhez.
ms: paparkan bantuan dengan command line
ro: afişează help pentru parametrii linie-de-comandă
ru: отображает помощь по параметрам командной строки

source: displays version information of usbpicprog
ar: إظهار معلومات عن هذا الإصدار من usbpicprog
bs: prikazuje informacije o verziji usbpicprog-a
cs: zobrazuje informaci o verzi usbpicprog
de: Versionsanzeige von usbpicprog
he: מציג גרסת מידע עבור usbpicprog
hu: Mutatja az Usbpicprog változatát.
ms: paparkan informasi versi usbpicprog
ro: afişează informaţii despre versiunea UsbPicProg
ru: отображает номер версии usbpicprog

source: do not display the hex file
ar: عدم إظهار ملف الهيكسا
bs: ne prikazuj hex datoteku
cs: nezobrazuj HEX soubor
de: Hex Datei nicht anzeigen
he: אל תציג את קובץ הHex
hu: A hex állományt nem lehet megjeleníteni.
ms: Jangan papar fail Hex
ro: nu afişa fişierul HEX
ru: не отображать hex файл

source: erase
ar: مسح
bs: briši
cs: vymazat
de: Löschen
he: מחיקה
hu: törlés
ms: Padam
ro: şterge
ru: Очистить

source: file
ar: ملف
bs: datoteka
cs: soubor
de: Datei
he: קובץ
hu: fájl
ms: Fail
ro: fişier
ru: файл

source: help
ar: تعليمات
bs: pomoć
cs: nápověda
de: Hilfe
he: עזרה
hu: súgó
ms: Bantuan
ro: ajutor
ru: помощь

source: hexfile
ar: ملف الهيكسا
bs: hex datoteka
cs: HEX soubor
de: Hex Datei
he: קובץ Jex
hu: hex állomány
ms: Fail Hex
ro: fişier HEX
ru: hex файл

source: new
ar: جديد
bs: novi
cs: nový
de: Neu
he: חדש
hu: új
ms: Baru
ro: nou
ru: новый

source: open
ar: فتح
bs: otvori
cs: otevřít
de: Öffnen
he: פתח
hu: megnyit
ms: Buka
ro: deschide
ru: открыть

source: packageview
bs: izgled pakovanja
cs: Ukázat pouzdro
de: Gehäuseansicht
he: תצוגת אריזה
hu: tokozás nézet
ro: vedere capsulă

source: pictype
ar: نوع الـPIC
bs: tip pic-a
de: PIC Typ
he: סוג PIC
hu: pic tipus
ms: jenis PIC
ro: tip microcontroller

source: program
ar: باشر البرمجة
cs: programovat
de: Programm
he: צריבה
hu: programoz
ms: programkan
ro: programează
ru: программа

source: read
ar: قراءة
bs: čitaj
cs: číst
de: Lesen
he: קריאה
hu: olvas
ms: baca
ro: citeşte
ru: прочесть

source: read the device
ar: قراءة العنصر
bs: pročitaj uređaj
cs: přečti součástku
de: Lesen des PIC
he: קריאת הרכיב
hu: az eszköz olvasása
ms: baca peranti
ro: citeşte microcontroller
ru: прочесть с устройства

source: reload
ar: إعادة تحميل
bs: učitaj ponovo
cs: obnovit
de: Erneut laden
he: טען מחדש
hu: újratölt
ms: muat semula
ro: reîncarcă
ru: перезагрузить

source: reset
ro: resetare

source: reset/reboot firmware/bootloader
ro: resetare/reboot a firmwareului/bootloaderului

source: restore-bandgap
bs: povrati-bandgap
cs: obnova-bandgap
de: Rückspeichern bandgap
he: שחזר את BANDGAP
hu: bandgap visszaállítás
ms: pulihkan-bandgap
ro: restaurare-bandgap

source: restore-osccal
bs: povrati-osccal
cs: obnova-osccal
de: Rückspeichen OSCCAL
he: שחזר Osccal
hu: osccal visszaállítás
ms: pulihkan-osccal
ro: restaurare-osccal

source: run
cs: spustit
de: Start
he: הרץ
hu: futtat
ms: jalankan
ro: lansare în execuţie
ru: запустить

source: run target device
cs: Spusť cílové zarízení
de: starte das Zielgerät
he: הרץ את רכיב המטרה
hu: futtatja a cél eszközt
ms: jalankan PIC
ro: lansare în execuţie a microcontrollerului
ru: запустить целевое устройство

source: save
ar: حفظ
bs: sačuvaj
cs: uložit
de: Speichern
he: שמור
hu: mentés
ms: simpan
ro: salvează
ru: сохранить

source: save as
ar: حفظ باسم
bs: sačuvaj kao
cs: uložit jako...
de: Speichern unter
he: שמור כ
hu: mentés mint
ms: simpan sebagai
ro: salvează ca...
ru: сохранить как

source: silent
ar: صامت
bs: tiho
de: stille
he: שקט
hu: csendes
ms: bisukan
ro: silenţios
ru: тихо

source: specify the pic type (eg -p=18F2550)
bs: odredi tip pic-a (npr. -p=18F2550)
cs: zadejte typ PICu (např. -p=18F2550)
de: Auswählen des PIC Typs (z.B. -p=18F2550)
he: ציין את סוג הPIC (eg -p=18F2550)
hu: megadja a PIC tipusát (pl. -p=18F2550)
ms: tentukan jenis PIC (eg -p=18F2550)
ro: specificaţi tipul microcontrollerului (de ex. -p=18F2550)
ru: укажите тип PIC (напр. -p=18F2550)

source: stop
he: עצור
hu: állj
ms: hentikan
ro: oprire
ru: остановить

source: stop target device
cs: Zastav cílové zařízení
de: stoppe das Zielgerät
he: עצור את רכיב המטרה
hu: megállítja a cél eszközt
ms: hentikan PIC
ro: oprire execuţie microcontroller
ru: остановить целевое устройство

source: tell firmware to reboot in bootloader mode
cs: dej pokyn firmwaru aby rebootoval do bootloader módu
ro: cere firmwareului să rebooteze în mod bootloader

source: unknown record type: %d
bs: nepoznati tip unosa: %d
cs: Neznámý typ záznamu: %d
de: Unbekannter Record Type: %d
he: סוג רישום לא ידוע : %d
hu: ismeretlen rekordtipus: %d
ro: tip înregistrare necunoscut: %d
ru: неизвестный тип записи: %d

source: untitled
ar: دون-عنوان
bs: bez imena
cs: bez názvu
de: Ohne Titel
he: ללא שם
hu: névtelen
ms: TiadaTajuk
ro: faratitlu
ru: безымянный

source: verify
ar: تفحص
bs: provjeri
cs: zkontrolovat
de: Vergleichen
he: אימות
hu: ellenőriz
ms: sahkan
ro: verifică
ru: проверка

source: verify the device
ar: تفحص العنصر
bs: provjeri uređaj
cs: zkontroluj součástku
de: Den PIC vergleichen
he: אימות הרכיב
hu: ellenőrzi az eszközt
ms: sahkan peranti
ro: verifică microcontrollerul
ru: проверить устройство

source: version
ar: الإصدار
bs: verzija
cs: verze
he: גרסה
hu: változat
ms: versi
ro: versiune
ru: версия

source: write
ar: كتابة
bs: upiši
cs: zapsat
de: Schreiben
he: כתיבה
hu: írás
ms: muaturun
ro: programează
ru: записать

source: write the device
ar: كتابة على العنصر
bs: upiši u uređaj
cs: zapiš součástku
de: Den PIC schreiben
he: כתיבת הרכיב
hu: írja az eszközt
ms: muaturun peranti
ro: programează microcontrollerul
ru: записать на устройство

source: RESET
de: Zurücksetzen
he: איתחול מחדש
hu: ALAPHELYZET
ru: СБРОС

source: Word %d
ar: الكلمة %d
bs: Riječ %d
cs: Slovo %d
de: Wort %d
he: מילה %d
hu: %d. szó
ru: Слово %d

source: Loads a HEX file from the examples folder
cs: Načte HEX soubor z adresáře examples

source: 0V
ru: 0В

source: 12V
ru: 12В

source: 3.3V
ru: 3.3В

source: 5V
ru: 5В

source: Frequency range: MIN MAX _dontTranslateThis_
ms: Julat frekuensi: MIN MAX _dontTranslateThis_
ru: Диапазон частот: MIN MAX _dontTranslateThis_

source: Programming voltage (Vpp): MIN NOM MAX _dontTranslateThis_
ru: Напряжение программирования (Vpp): MIN NOM MAX _dontTranslateThis_

source: Working voltages (Vdd): MIN NOM MAX _dontTranslateThis_
ru: Рабочие напряжения (Vdd): MIN NOM MAX _dontTranslateThis_
